{
  "heavenly-tahoe": {
    "resortId": "heavenly-tahoe",
    "generatedAt": "2026-01-09T23:03:32.296Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Heavenly offers an expansive ski experience across two states (California and Nevada), renowned for its breathtaking views of Lake Tahoe and diverse terrain. While its sprawling layout can mean more traversing, it delivers an incredible mix of perfectly groomed cruisers, challenging steeps, and excellent tree skiing for all ability levels.",
    "localTips": [
      "On powder days, head straight to Mott Canyon or Killebrew Canyon (if open) for the best expert terrain and deep snow, or Comet Express for excellent intermediate glades.",
      "Arrive early, especially on weekends and holidays. Aim to be in a parking lot by 8:00 AM to secure a spot and beat the initial rush to the lifts.",
      "Avoid the Gondola line at its peak (9:30 AM - 10:30 AM). If staying near the Village, take the Gondola before 9 AM or after 10:30 AM. Otherwise, drive to California Lodge or Stagecoach.",
      "Ski the Nevada side (accessed via Stagecoach or Comet Express) in the morning for fewer crowds and often better snow conditions, then move to the California side later for afternoon sun.",
      "Pack snacks and water to avoid overpriced on-mountain food and long lines at lodges during peak lunch hours (12 PM - 1:30 PM).",
      "Utilize the Sky Express and Dipper Express on the California side for efficient laps on intermediate and advanced terrain, often less congested than Tamarack.",
      "Explore the tree skiing off the Dipper Express (e.g., The Burn, Maggie's trees) after a fresh snowfall – always ski with a buddy and know your limits."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Patsy's",
        "Big Easy",
        "Enchanted Forest",
        "Boulder Bowl"
      ],
      "intermediate": [
        "Skyline Trail",
        "Groove",
        "Maggie's Run",
        "Liz's",
        "Ridge Run",
        "Olympic Downhill"
      ],
      "advanced": [
        "Gunbarrel",
        "East Bowl",
        "The Burn",
        "Stagecoach Run (lower sections)",
        "Waterfall"
      ],
      "expert": [
        "Mott Canyon (accessed via gate)",
        "Killebrew Canyon (accessed via gate)",
        "East Peak (unmarked areas)",
        "The Face"
      ]
    },
    "hiddenGems": [
      "The glades off Big Dipper Express between Maggie's and The Burn, offering fun, less tracked tree skiing.",
      "The short, steep pitch of Sierra Vista (off Dipper Express) – often overlooked but a great advanced challenge.",
      "The runs off Comet Express (Nevada side) in the morning – often quieter with excellent corduroy or fresh snow.",
      "East Peak Lodge for a quiet break and stunning views without the crowds of Tamarack Lodge."
    ],
    "avoidList": [
      "The Gondola line between 9:30 AM and 10:30 AM on any busy day.",
      "California Lodge base area for lunch; it's extremely crowded and chaotic.",
      "Tamarack Lodge for lunch during peak hours; long lines and overpriced, mediocre food.",
      "Staying exclusively on the California side; you'll miss out on the generally less crowded and often better snow conditions of the Nevada side.",
      "The Patsy's beginner area after 11 AM, as it becomes swamped with lesson groups."
    ],
    "foodRecs": {
      "onMountain": [
        "East Peak Lodge (best views, less crowded than Tamarack)",
        "Nevada Lodge (quieter, good spot on the Nevada side)",
        "Stagecoach Lodge (quick bites and warm-up, Nevada side)"
      ],
      "base": [
        "Base Camp Pizza Co. (Heavenly Village - lively, great pizza)",
        "The Loft Bistro (Heavenly Village - more upscale, good cocktails)",
        "Samurai Restaurant (South Lake Tahoe - excellent sushi, local favorite)",
        "Lucky Beaver Bar & Burger (Stateline, NV - great burgers, open late)"
      ]
    },
    "parkingStrategy": "Aim to arrive by 8:00 AM - 8:30 AM on weekends/holidays and 8:30 AM - 9:00 AM on weekdays. California Lodge (paid) is convenient but fills fastest. Stagecoach Lodge (paid) offers the best access to the Nevada side and often has spaces slightly longer. Boulder Lodge (paid) is another Nevada option. If these are full, the Heavenly Village Parking Garage (paid) is a reliable but pricier option. Carpooling is highly recommended.",
    "crowdPatterns": "Mornings (9:00 AM - 10:30 AM) see the longest lines at the Gondola and California Lodge. Mid-day (11:00 AM - 2:00 PM) brings heavy traffic to main lifts like Tamarack, Dipper, and Sky, and on-mountain lodges become packed. Crowds thin out significantly after 2:30 PM, especially on the Nevada side. Weekends and holidays are substantially busier across the entire resort, with powder days drawing the biggest crowds early to expert terrain gates and popular lifts."
  },
  "okemo": {
    "resortId": "okemo",
    "generatedAt": "2026-01-09T23:03:30.192Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Okemo is renowned for its immaculately groomed, wide-open cruisers and family-friendly atmosphere, making it a favorite for intermediates and those who appreciate consistent conditions. With a diverse network of high-speed lifts and distinct base areas, it offers a well-rounded New England ski experience focused on comfortable, enjoyable skiing.",
    "localTips": [
      "Start your day at Jackson Gore on busy weekends to avoid the initial rush at the Sunburst Six base area; the parking garage offers quick access.",
      "Head to the Glades Peak area (via Glades Peak Quad) for generally quieter intermediate and advanced terrain, especially later in the morning.",
      "Utilize the Quantum Four lift to lap intermediate terrain like Sidewinder and World Cup if Sunburst Six lines get too long.",
      "For pristine corduroy, hit the steeper runs off the top of the Sunburst Six first thing in the morning, like World Cup or Upper Tomahawk.",
      "Explore the tree zones like 'Dark Star' or 'Jackson Gore Glade' on powder days, but be aware Okemo's glades can be dense; check conditions first.",
      "The Bubble Six is excellent for cold days, offering enclosed comfort, but it can be slower to load due to the bubble mechanism; use Quantum Four if speed is a priority.",
      "On sunny days, take a break at the Solitude Day Lodge for a more relaxed atmosphere and better food options compared to the main base lodges."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Lower Tomahawk",
        "Coleman Brook",
        "Open Slope",
        "Learning Zone (off Quantum Four)"
      ],
      "intermediate": [
        "Sidewinder",
        "World Cup",
        "Countdown",
        "Dream Maker",
        "Scorpion",
        "Buckhorn"
      ],
      "advanced": [
        "Exhibition",
        "Outer Limits",
        "Loose Spruce",
        "Sel's Choice (often mogul-filled)",
        "Big Bang (ungroomed/moguls)"
      ],
      "expert": [
        "Blind Faith (can be steep and icy)",
        "Dark Star Glade",
        "Jackson Gore Glade",
        "Boom Boom"
      ]
    },
    "hiddenGems": [
      "The trails off the Glades Peak Quad (e.g., Upper Rimrock, Coleman Brook) consistently offer less crowded, well-maintained skiing.",
      "The views from the top of Sel's Choice, overlooking the Ludlow valley, are spectacular and often overlooked by those rushing down.",
      "Solitude Day Lodge offers a quieter, more upscale dining experience with panoramic views, perfect for escaping the base lodge chaos.",
      "The 'Upper Chief' glade, when open and snowy, can hold fresh powder longer than other more accessible tree runs."
    ],
    "avoidList": [
      "The Sunburst Six lift on Saturday mornings (8:30-10:00 AM) due to massive lines; opt for Quantum Four or head to Jackson Gore.",
      "Base lodge cafeterias for lunch if possible; they can be overpriced, crowded, and chaotic. Pack snacks or seek out Solitude Day Lodge.",
      "The beginner slopes at the very bottom of Sunburst Six during peak times; they become extremely congested with lessons and slow traffic."
    ],
    "foodRecs": {
      "onMountain": [
        "Coleman Brook Tavern (Jackson Gore, upscale sit-down)",
        "Solitude Day Lodge (more refined menu, less chaotic)",
        "Waffle Cabin (base of Sunburst Six for a quick, delicious treat)"
      ],
      "base": [
        "The Killarney (Ludlow, classic pub fare, lively atmosphere)",
        "Mr. Darcy's Bar & Grill (Ludlow, solid pub food, local favorite)",
        "Stemwinder (Ludlow, for excellent cocktails and upscale casual dinner)"
      ]
    },
    "parkingStrategy": "On weekends and holidays, aim to arrive by 8:00 AM for the best spots in the Jackson Gore parking garages for direct base access. If arriving later, utilize the outer lots at Jackson Gore and take the shuttle, or try the Sunburst Six lot which fills very quickly. Weekdays, 8:30-9:00 AM is usually sufficient for convenient parking.",
    "crowdPatterns": "Weekends typically see peak crowds from 9:30 AM to 12:30 PM, particularly around the Sunburst Six and Quantum Four lifts. Crowds thin out noticeably after 1:00 PM. Jackson Gore generally feels less congested than the Sunburst side, especially in the mornings. Holidays are consistently busy all day, while mid-week skiing offers significantly lighter crowds and open runs."
  },
  "mount-snow": {
    "resortId": "mount-snow",
    "generatedAt": "2025-12-09T07:49:45.633Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Mount Snow is a highly accessible, family-friendly resort celebrated for its exceptional grooming, extensive terrain parks in Carinthia, and a wide array of intermediate cruising runs. It offers a classic Southern Vermont ski experience, prioritizing consistent conditions and a welcoming atmosphere over extreme terrain.",
    "localTips": [
      "Hit the Bluebird Express right at opening (8:00 AM weekends, 9:00 AM weekdays) to get fresh corduroy on runs like Beeline or Freefall before crowds build.",
      "For advanced intermediates seeking a challenge without the steeps, explore the Sunbrook side via the Sunbrook Express for consistently good groomers and significantly less traffic.",
      "If the main mountain glades are tracked out, advanced skiers can find often uncrowded and well-preserved glades like Fallen Timbers off the Challenger lift.",
      "Always check the snow report for natural versus machine-made snow; Mount Snow excels at snowmaking, ensuring reliable coverage even in lean years.",
      "Consider skiing the Carinthia Parks on weekdays for more laps and fewer people, allowing for better progression.",
      "To bypass the Bluebird Express bottleneck mid-morning on busy days, take the Grand Summit Express up and traverse towards the Challenger or Sundance lifts.",
      "Pack snacks and water to avoid overpriced lodge food and save valuable ski time during peak lunch rushes.",
      "If conditions are icy, stick to the main groomed trails like Beeline or Snowdance, as Mount Snow's snowmaking creates a durable, consistent surface."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Long John",
        "Cooper's Junction",
        "Mixing Bowl (early morning only)"
      ],
      "intermediate": [
        "Beeline",
        "Snowdance",
        "Freefall",
        "Crossover",
        "Ego Alley",
        "Quantum Leap"
      ],
      "advanced": [
        "Jester",
        "Canyon",
        "Ripcord",
        "River Run",
        "Challenger"
      ],
      "expert": [
        "Fallen Timbers",
        "Uncles",
        "The Haul (Carinthia - hike to)",
        "Freefall Glade",
        "Exhibition Glades"
      ]
    },
    "hiddenGems": [
      "Sunbrook Side: Consistently less crowded, offering uninterrupted intermediate cruising with great views and dedicated lifts.",
      "The Haul: A short but steep, hike-to glade within Carinthia Park, often holding fresh snow longer than main mountain glades.",
      "Summit Lodge: Accessible from the Bluebird Express, it's a great spot for a quick, quieter break with better views and often less chaos than the base lodges.",
      "The backside glades off Challenger (e.g., Fallen Timbers, The Abyss) often retain snow quality and see significantly less traffic.",
      "Grand Summit Hotel's Slopeside Access: If staying there, the direct ski-in/ski-out bypasses the main base lodge entirely, especially helpful for early morning laps."
    ],
    "avoidList": [
      "Bluebird Express Line (peak times): From 10 AM to 1 PM on weekends and holidays, waits can be substantial. Use the Grand Summit Express or Challenger lifts as alternatives.",
      "Main Base Lodge Cafeteria (lunch rush): Overpriced, crowded, and inefficient. Pack a lunch or plan to eat very early or late.",
      "The 'Mixing Bowl' area (mid-day): Can become an overwhelming congestion point for beginners, instructors, and cross-traffic, especially after 11 AM.",
      "Sundance Lift: While it accesses good terrain, it's a slower, fixed-grip quad that can feel tedious for multiple laps if other faster options are available.",
      "On-mountain rental shops: Generally more expensive and slower than renting in advance from local shops in West Dover or Wilmington."
    ],
    "foodRecs": {
      "onMountain": [
        "Summit Lodge: Best for a quick bite, decent chili, and a less chaotic bar scene with good views.",
        "Bullwheel Pub (Carinthia Base Lodge): Good for a sit-down meal, craft beers, and elevated pub fare without leaving Carinthia.",
        "Sunbrook Base Lodge: Limited but quieter options, ideal if you're skiing the Sunbrook side."
      ],
      "base": [
        "Dot's Restaurant (Wilmington): A classic, no-frills diner perfect for a hearty breakfast or lunch.",
        "The Dover Forge Restaurant (West Dover): Excellent pub fare, lively atmosphere, and a great dinner spot with a diverse menu.",
        "Sticky Fingers Bakery & Cafe (West Dover): Perfect for coffee, fresh pastries, and delicious sandwiches for breakfast or lunch.",
        "1846 Tavern & Grille (Grand Summit Hotel): A more upscale option for dinner, convenient if staying at the hotel."
      ]
    },
    "parkingStrategy": "Arrive early, targeting 8:00 AM on weekends/holidays, to secure a spot in the Main Base Area Lot (A or B) closest to the Bluebird Express. If full, the Carinthia Base Area Lot offers direct access to its own lifts and shuttle service to the main base. The Sunbrook Lot is the furthest but often has space and offers direct access to quieter intermediate terrain; utilize this if your focus is on that side. Shuttles run frequently from all outer lots.",
    "crowdPatterns": "Weekends, especially Saturday mornings and holiday periods (MLK, Presidents' Day, etc.), experience the heaviest crowds, with Bluebird Express lines peaking between 10 AM and 1 PM. Mid-week (Tuesday-Thursday) is significantly quieter, offering minimal lift lines and wide-open groomers. Friday and Sunday afternoons can be a good balance as many weekenders are arriving or departing. Carinthia can be busy with park riders but its dedicated lifts manage the flow well, while the Sunbrook side consistently has lower traffic throughout the week."
  },
  "kirkwood": {
    "resortId": "kirkwood",
    "generatedAt": "2026-01-10T00:55:36.858Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Kirkwood is a rugged, big-mountain destination renowned for its abundant snowfall and steep, challenging terrain, offering a genuine expert's paradise. It maintains a less-commercialized atmosphere compared to other Tahoe resorts, often providing fewer crowds and deeper powder stashes.",
    "localTips": [
      "On a powder day, head straight to Chair 10 (The Wall) for immediate access to steeps, or Chair 11 (Wagon Wheel) for tree skiing that holds snow longer.",
      "For consistent groomers, lap Chair 6 (Cornice Express) early morning, then explore Chair 13 (Sunrise) as it opens for fresh corduroy.",
      "Don't ignore Chair 5 (Caples Lake) after a storm; the glades off Thunder Saddle can hold fresh snow for days.",
      "Always check the mountain operations page; Kirkwood is notorious for delayed lift openings due to high winds or avalanche control.",
      "Pack snacks and water. On-mountain food options are limited and pricey, saving you money and time.",
      "Explore the looker's left of Chair 4 (Palisades) for fun, advanced glades that stay less tracked than The Wall.",
      "On busy weekends, avoid the main base area around Snowkirk (Chair 1) and head straight to Timber Creek for shorter lines and easier access to the mountain.",
      "If you're comfortable, traverse far out on The Wall for untouched lines, but always know your limits and ski with a buddy."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Snowkirk",
        "Lower Zach's",
        "Bunny",
        "Lower Mountain Run"
      ],
      "intermediate": [
        "Mokelumne",
        "Olympic",
        "Sentinel",
        "Home Run",
        "Iron Horse",
        "Eagle Bowl"
      ],
      "advanced": [
        "Monte Wolf",
        "Outrigger",
        "Look Out Janek",
        "Idiot's Delight",
        "Waterfall",
        "Palisades Glades"
      ],
      "expert": [
        "The Wall (Cirque, Excelsior)",
        "Thunder Saddle",
        "The Wave",
        "Thunder Mountain",
        "The Notch",
        "Fingers Chutes"
      ]
    },
    "hiddenGems": [
      "The trees between Iron Horse and Caples Crest off Chair 5.",
      "The 'Backside' glades accessible via a traverse from the top of Chair 11 (Wagon Wheel) – use caution and local knowledge.",
      "The glades skiers' right of Sunrise Lift (Chair 13) towards Vista Ridge.",
      "Skiers' left off Cornice Express (Chair 6) into the trees after Outrigger, heading towards Sentinel.",
      "The 'Snorkel Trees' off the traverse to Thunder Saddle, known for holding snow."
    ],
    "avoidList": [
      "The Cornice Express (Chair 6) line during peak weekend hours (10 AM - 1 PM) can get very long.",
      "Food at the main Base Lodge (Snowkirk Lodge) is often crowded and overpriced; better options exist slightly further afield.",
      "Trying to park in the main Timber Creek lot after 9:30 AM on a powder day or busy weekend, you'll likely be relegated to outer lots.",
      "Relying solely on 'The Wall' (Chair 10) for sustained runs; it's short but sweet, use it for quick laps then move to other areas for longer descents."
    ],
    "foodRecs": {
      "onMountain": [
        "Wall Bar & Grill (top of Chair 10): Great views, casual pub fare.",
        "Monte Wolfes (mid-station Chair 6): Good spot for a quick burger or chili.",
        "Kirkwood General Store (Village): Grab-and-go deli sandwiches and snacks."
      ],
      "base": [
        "Kirkwood Inn & Restaurant (historical spot, just outside the main village): Classic American comfort food, cozy atmosphere.",
        "The Cornice Grill (Timber Creek Base): Decent burgers and wraps, usually less crowded than the main lodge."
      ]
    },
    "parkingStrategy": "Arrive by 8:00 AM on weekends and powder days to secure a spot in the primary Timber Creek (P1) or Red Cliffs (P2) lots, which offer convenient access. On slower weekdays, arriving by 9:00 AM is usually fine. If main lots are full, use the shuttle from outer lots like The Meadows. Always follow signage as certain areas become permit-only.",
    "crowdPatterns": "Kirkwood generally sees lighter crowds than other Lake Tahoe resorts, especially on weekdays. Weekends, particularly during peak season and after fresh snow, can draw more people, with Cornice Express (Chair 6) and The Wall (Chair 10) experiencing the longest lift lines, peaking between 10:30 AM and 1:30 PM. Crowds thin out significantly after 2:30 PM."
  },
  "hunter-mountain": {
    "resortId": "hunter-mountain",
    "generatedAt": "2026-01-10T00:55:47.406Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Hunter Mountain is a bustling Catskill resort, renowned for its extensive snowmaking and diverse terrain spread across three distinct peaks. Its proximity to the NYC metro area makes it a magnet for weekend warriors, offering everything from gentle learning slopes to challenging glades and steep groomers. Expect a lively atmosphere, especially on peak days, balanced by efficient operations and a variety of trail options.",
    "localTips": [
      "Arrive Early: Especially on weekends, be in the main parking lot by 7:30 AM to secure a good spot and beat initial lift lines.",
      "Hunter North First: On busy days, head straight to Hunter North via the Z-Lift. The terrain often holds snow better, and it can be less crowded early on.",
      "Utilize the West Side: If the Main Mountain is packed, explore the West Side via the E-Lift for more challenging intermediate and advanced runs that often have shorter lines.",
      "Ski the Edges: When navigating popular runs like Kennedy Drive or Broadway, stick to the sides for fewer traffic jams, especially at merge points.",
      "Lift Strategy: Prioritize the Kaatskill Flyer (F-Lift) or Z-Lift (North) over the D-Lift (gondola) on weekends unless you specifically need access to Hunter One.",
      "Check Conditions for Glades: Hunter North's glades (Northern Exposure, Mossy Brook) are excellent after fresh snow but can get scraped quickly. Check the snow report carefully.",
      "Mid-Week is Gold: If possible, visit Monday-Thursday for significantly reduced crowds and often pristine conditions."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Hunter One",
        "Belt Parkway",
        "Broadway (upper section from Kaatskill Flyer)"
      ],
      "intermediate": [
        "Kennedy Drive",
        "Way Out",
        "Crossover",
        "Racer's Edge",
        "Clair's Way"
      ],
      "advanced": [
        "Minya Konka",
        "Eisenhower",
        "Rip Van Winkle",
        "Hellgate",
        "K2"
      ],
      "expert": [
        "Jimmie Heuga's Edge",
        "Westway Glades",
        "Northern Exposure Glades",
        "Mossy Brook"
      ]
    },
    "hiddenGems": [
      "Lower Broadway in the AM: Before the crowds thin out the snow, the lower section of Broadway can be a surprisingly fun, wide cruiser.",
      "The West Side Traverse: A less-used path that connects the West Side to the Main Mountain, offering a quiet, scenic route away from the main thoroughfares.",
      "Early Morning Groomers on the North Side: Z-Lift (Hunter North) provides access to beautifully groomed black diamonds like Claire's Way (a steep blue/easy black) and runs like K2 before they get too tracked.",
      "Scenic Overlook on Broadway: Just before the turn towards the D-Lift, there's a small flat spot on Broadway with expansive views of the Catskills."
    ],
    "avoidList": [
      "D-Lift (Gondola) on Weekends: Unless you are strictly going to Hunter One, this lift often has the longest lines and doesn't access the best terrain efficiently.",
      "Main Base Lodge Cafeteria at Peak Lunch Hours: Overpriced, crowded, and basic food. Pack a lunch or eat early/late.",
      "Broadway during Mid-Day: This main thoroughfare becomes extremely congested with all levels of skiers, leading to slow traffic and potential collisions.",
      "Buying Gear at the Resort Shop: Expect inflated prices; buy essentials off-mountain or beforehand."
    ],
    "foodRecs": {
      "onMountain": [
        "Van Winkle's (Main Lodge)",
        "Way Out Cafe (West Side)",
        "Schuss Pass (Hunter North)"
      ],
      "base": [
        "Brio's Pizzeria (Tannersville)",
        "Prospect at Scribner's Catskill Lodge (Hunter)",
        "Last Chance Antiques & Cheese Cafe (Tannersville)"
      ]
    },
    "parkingStrategy": "Arrive by 7:30 AM on weekends and holidays to secure a spot in the Main Lot, which offers the easiest access to the lodge and lifts. If you arrive later, you'll likely be directed to the North Lot (good for Hunter North access) or overflow lots with shuttle service. Parking fills up rapidly, so punctuality is key. Consider carpooling to save space and potentially time.",
    "crowdPatterns": "Hunter experiences significant crowds on weekends, especially during peak season (mid-January to mid-March) and holidays. Saturday mornings and early afternoons are the busiest. Sundays typically start busy but often thin out after 2 PM as day-trippers head home. Weekdays are generally much lighter, offering the best conditions and minimal lift lines. Lifts like the D-Lift (gondola) and the bottom of Kaatskill Flyer (F-Lift) see the longest lines during peak times. The North Side and West Side can offer some respite from the main mountain crowds."
  },
  "valfrejus": {
    "resortId": "valfrejus",
    "generatedAt": "2025-12-10T17:28:33.294Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Valfrejus is a charming and unpretentious French resort in the Maurienne Valley, celebrated for its excellent value, relaxed atmosphere, and typically uncrowded slopes. It's a fantastic choice for families and those seeking a less bustling experience, offering diverse terrain with particularly good tree skiing opportunities for all levels.",
    "localTips": [
      "Head straight to the Punta Bagna or L'Armera lifts on powder mornings to find the best fresh tracks before the crowds.",
      "Explore the marked 'Piste des Trappeurs' (blue) for a fun, winding run through the forest that often remains quiet.",
      "During whiteout conditions, stick to the tree-lined runs like Les Essarts or Les Glaciers for improved visibility and definition.",
      "For a more affordable and varied lunch experience, ski down to the village rather than relying solely on the on-mountain restaurants.",
      "Utilize the Col du Jeu chairlift in the afternoon; it accesses some lovely intermediate terrain that often sees fewer skiers than the main gondola area.",
      "Keep an eye on the sun-exposed slopes around Plateau d'Arrondaz on colder days, as the snow tends to soften there first.",
      "Don't shy away from the short but steep black run 'Le Lavoir' when conditions are good; it's a great challenge for advanced skiers within the resort."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Plateau d'Arrondaz (nursery slopes at the top of the gondola)",
        "Les Bergers (green)",
        "Le Jeu (green)"
      ],
      "intermediate": [
        "L'Armera (blue)",
        "Col du Jeu (blue)",
        "Les Essarts (blue)",
        "Combe Orcières (blue)",
        "Piste des Trappeurs (blue)"
      ],
      "advanced": [
        "Les Glaciers (red, steep and often well-groomed)",
        "Le Lavoir (black)",
        "Punta Bagna (black, especially the top section)"
      ],
      "expert": [
        "Ungroomed sections adjacent to Les Glaciers (conditions permitting)",
        "Steeper, ungroomed sections directly under the Punta Bagna lift",
        "Off-piste descents from Pointe d'Arrondaz (requires local knowledge or a guide)"
      ]
    },
    "hiddenGems": [
      "The small snack shack near the top of the Col du Jeu lift for a quiet, budget-friendly coffee or vin chaud with stunning views.",
      "The gladed areas accessible from the sides of Les Essarts and L'Armera for safe, playful tree skiing on powder days.",
      "The furthest reaches of the L'Armera blue run provide excellent, less trafficked cruising with beautiful scenery."
    ],
    "avoidList": [
      "The main Arrondaz Telecabin (gondola) between 9:00 AM - 10:00 AM on weekend and holiday mornings due to potential queues.",
      "Overpriced and often crowded 'Le Relais de la Pointe' at Plateau d'Arrondaz for lunch; better options exist in the village.",
      "The lower, flatter sections of runs like lower L'Armera late in the day, as they can become heavily scraped and icy.",
      "The short, slow 'Le Chalet d'Arrondaz' drag lift unless you're a absolute beginner; better to use the chairlifts for progression."
    ],
    "foodRecs": {
      "onMountain": [
        "L'Altipiano (at Plateau d'Arrondaz): Good variety, spacious, and decent food with a lively atmosphere.",
        "L'Armera (near the L'Armera lift top station): A more rustic, traditional option known for Savoyard specialties and smaller crowds."
      ],
      "base": [
        "La Cordée (village): Excellent for traditional French and local Savoyard cuisine, especially raclette and tartiflette.",
        "Le Bistrot (village): A casual spot offering good value pizzas, burgers, and hearty daily specials.",
        "Bar/Restaurant Les Bergers (at the foot of the nursery slopes): Convenient for families, great for a quick lunch or après-ski drink."
      ]
    },
    "parkingStrategy": "On weekends and during French school holidays, arrive before 8:30 AM to guarantee a spot in the heated underground P1 (Parking Téléo) lot directly at the base of the gondola. On weekdays, arriving by 9:00 AM is generally sufficient. If P1 is full, follow signs for smaller overflow lots further down the access road, but be prepared for a short walk or shuttle bus.",
    "crowdPatterns": "Valfrejus generally experiences lighter crowds than larger resorts. The main gondola bottleneck is typically between 9:00 AM and 10:00 AM on peak days. Slopes are quietest mid-morning (10:30 AM - 12:00 PM) and mid-afternoon (2:00 PM - 4:00 PM). On-mountain restaurants are busiest from 12:30 PM to 1:30 PM. The upper lifts like Punta Bagna and Col du Jeu usually offer the least crowded skiing throughout the day, especially mid-week outside of school holidays."
  },
  "aspen-snowmass": {
    "resortId": "aspen-snowmass",
    "generatedAt": "2026-01-10T00:55:44.945Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Aspen Snowmass is not a single entity but a constellation of four distinct mountains – Snowmass, Aspen Mountain (Ajax), Aspen Highlands, and Buttermilk – all accessible on one pass. This unparalleled diversity offers everything from gentle beginner slopes to extreme expert terrain like Highlands Bowl, complemented by world-class grooming and a vibrant après-ski culture that caters to a discerning clientele.",
    "localTips": [
      "Utilize the extensive free RFTA bus system to travel between all four mountains and towns; it's more efficient than driving and avoids costly parking.",
      "Start your day at Aspen Mountain or Highlands before 9 AM on powder days or weekends to beat the lines on the Silver Queen Gondola or Exhibition lift.",
      "On busy days, head to Aspen Highlands. Even if the base is crowded, the sheer size and the hike to Highlands Bowl tend to spread people out significantly.",
      "For the best corduroy, hit the Tiehack side of Buttermilk early in the morning – it's often overlooked and less crowded than Snowmass's groomed runs.",
      "Pack a lunch and snacks. On-mountain food, while excellent, can be notoriously expensive. Take advantage of designated picnic spots with incredible views.",
      "Explore the 'hidden' glades on each mountain, such as those off the Bell Mountain lift on Aspen Mountain or the lower parts of Temerity at Highlands, for untracked snow long after a storm.",
      "Check the daily 'Ullr News' or local paper for real-time mountain conditions, less crowded lift recommendations, and event schedules."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "West Buttermilk (Buttermilk)",
        "Panda Peak (Buttermilk)",
        "Sam's Knob (Snowmass)",
        "Fanny Hill (Snowmass)"
      ],
      "intermediate": [
        "Long Shot (Snowmass)",
        "Campground (Snowmass)",
        "Sneaky's Glade (Snowmass)",
        "Silver Queen (Aspen Mountain)",
        "Ruthie's Run (Aspen Mountain)",
        "Golden Horn (Highlands)"
      ],
      "advanced": [
        "Walsh's (Aspen Mountain)",
        "Shoulder of Bell (Aspen Mountain)",
        "Cirque Headwall (Snowmass)",
        "High Alpine (Snowmass)",
        "Grizzly Road (Highlands)",
        "Olympic Bowl (Highlands)"
      ],
      "expert": [
        "Highlands Bowl (B-Runs, Steeplechase, G-8 - Highlands)",
        "Hanging Valley Wall (Snowmass)",
        "The Cirque Cornice (Snowmass)",
        "Ridge of Bell (Aspen Mountain)",
        "Zaugg Dumps (Aspen Mountain)"
      ]
    },
    "hiddenGems": [
      "Picnic Point on Snowmass: An incredible view of the Maroon Bells near the top of Big Burn, perfect for a packed lunch away from the crowds.",
      "Temerity Glades (Highlands): Accessed via the Temerity lift, these glades offer excellent tree skiing with consistent snow, often overlooked for the Bowl.",
      "Garfield's Glades (Snowmass): A playful, moderately steep gladed area off the Big Burn lift that retains soft snow.",
      "The Glades on Bell Mountain (Aspen Mountain): Explore skier's left from the Bell Mountain lift for some less-tracked tree runs.",
      "Buttermilk's Tiehack side: Great for fast, empty laps on freshly groomed corduroy, especially on busy days when other mountains are packed."
    ],
    "avoidList": [
      "Silver Queen Gondola at peak times (9:30-10:30 AM & 3:00-4:00 PM): Use Lift 1A or Ajax Express for quicker access to Aspen Mountain's lower slopes.",
      "Elk Camp Restaurant (Snowmass) during lunch rush: It becomes a chaotic cafeteria. Opt for Sam's (reservations recommended) or Gwyn's High Alpine for a more relaxed experience, or pack your own.",
      "Base Village Parking (Snowmass): Can be very expensive ($30+/day) and fills quickly. Use the free RFTA shuttle from Snowmass Town Park instead.",
      "On-mountain coffee or hot chocolate at lodges: Expect sticker shock. Bring a reusable thermos for hot beverages.",
      "Any lift line that extends into the mazes (e.g., Big Burn, Elk Camp Gondola) past 10 AM on a weekend: Consider shifting to a less popular lift or mountain, or take a quick coffee break."
    ],
    "foodRecs": {
      "onMountain": [
        "Sam's (Snowmass): Upscale Italian with excellent views. Reservations recommended.",
        "Gwyn's High Alpine (Snowmass): European-inspired dishes, quieter, great for a sit-down lunch.",
        "Cloud Nine Alpine Bistro (Highlands): Famous for champagne spraying and fondue. Reservations essential, splurge-worthy.",
        "Sundek (Aspen Mountain): Casual outdoor grill with fantastic views, good for a quick bite."
      ],
      "base": [
        "Big Hoss Grill (Snowmass Village): Casual, family-friendly BBQ and American classics, good value.",
        "New York Pizza (Aspen): Reliable and affordable pizza by the slice or whole pie, perfect après-ski.",
        "Ajax Tavern (Aspen): Located at the base of Aspen Mountain, known for its truffle fries and lively après scene.",
        "Venga Venga Cantina & Tequila Bar (Snowmass Village): Solid Mexican food and margaritas, excellent après spot with outdoor fire pits."
      ]
    },
    "parkingStrategy": "For Snowmass, park for free at Snowmass Town Park (off Brush Creek Road) and take the frequent free shuttle directly to the Base Village. Arrive by 8:30 AM on weekends/powder days. For Aspen Mountain, use the paid Rio Grande Parking Garage in downtown Aspen and walk to the Silver Queen Gondola or take a short shuttle. For Aspen Highlands, free parking is available at the base, but it fills extremely early (7:45 AM on busy days); overflow is often directed to Buttermilk with shuttle service. Buttermilk offers the easiest and most consistently available free parking at its base.",
    "crowdPatterns": "On weekends and holidays, expect early morning rushes at Aspen Mountain's Silver Queen Gondola and Snowmass's Elk Camp Gondola (9:30-10:30 AM). Powder days see experts flock to Aspen Mountain and Highlands, making Buttermilk the least crowded option even with fresh snow. Crowds generally thin out after 1 PM, but expect bottlenecks for downloading the Aspen Mountain gondola between 3:30-4:30 PM. Mid-week (Tues-Thurs) outside of peak season offers significantly lighter crowds across all four mountains, with Snowmass's vast terrain best able to absorb any larger numbers."
  },
  "park-city": {
    "resortId": "park-city",
    "generatedAt": "2025-12-10T17:30:33.052Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Park City Mountain Resort, the largest ski resort in the U.S., offers an expansive and diverse terrain perfect for all skill levels. It features two distinct base areas – Park City Mountain Village and Canyons Village – connected by the Quicksilver Gondola, providing a vast interconnected experience.",
    "localTips": [
      "On powder mornings, head straight to Jupiter Lift from the Park City side, or 9990 Lift from the Canyons side, for the best ungroomed snow before the crowds arrive.",
      "Utilize the Crescent Express Lift early from the Park City base to bypass Payday Express queues and access the central mountain faster.",
      "For less crowded intermediate terrain, especially mid-day, venture over to the Sun Peak and Super Condor lifts on the Canyons side.",
      "If staying in town, use the free public bus system to get to the resorts; it's more efficient than driving and battling for parking.",
      "Don't ski Homerun to the Park City base at the end of the day; it gets very crowded and scraped off. Instead, take Town Lift if available, or download the Payday Express.",
      "Explore the Iron Mountain area via the Iron Mountain Express at Canyons for varied terrain, often with fewer people than central Canyons."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "First Time",
        "Homerun (upper section)",
        "Sweet Pea",
        "Red Pine Road (upper part)"
      ],
      "intermediate": [
        "King Con",
        "Parley's Park",
        "Doc's Run",
        "Sun Peak",
        "Saddleback Express",
        "Chicane"
      ],
      "advanced": [
        "McConkey's Bowl",
        "Jupiter Access",
        "Black Forest",
        "Thaynes Canyon",
        "Pinecone Ridge",
        "Charlie's Dream"
      ],
      "expert": [
        "Jupiter Peak (chutes)",
        "Puma Bowl",
        "Ninety-Nine 90 (steep pitches)",
        "Murdock Peak",
        "The Super Bowl"
      ]
    },
    "hiddenGems": [
      "The trees off Iron Mountain Express for untouched powder a day or two after a storm.",
      "Fantasy Land and Canis Major/Minor accessed from Jupiter Lift for challenging glades.",
      "Sunrise Bowl after a fresh snowfall, often overlooked by those heading directly to McConkey's.",
      "The runs off the Peak 5 Express at Canyons, specifically the glades like 'The Pines', for quiet and playful tree skiing."
    ],
    "avoidList": [
      "Payday Express Lift at Park City Base between 9:30 AM and 10:30 AM, especially on weekends; queues are massive.",
      "The main Canyons Village Gondola for uphill access after 9:30 AM; opt for Red Pine Gondola if available or go early.",
      "Eating lunch at Cloud Dine or Red Pine Lodge between 12:00 PM and 1:30 PM; expect long lines and crowded tables.",
      "Driving to the Park City Mountain Village or Canyons Village base on weekends or holidays without a parking reservation; you'll be turned away.",
      "Skiing the Lower Homerun trail to the Park City base at the very end of the day, as it gets icy, crowded, and mogulled out."
    ],
    "foodRecs": {
      "onMountain": [
        "Mid-Mountain Lodge (Park City side) for solid chili and historical ambiance, often less crowded than other central lodges.",
        "Lookout Cabin (Park City side) for a more upscale lunch experience with excellent views and sit-down service (reservations recommended).",
        "Cloud Dine (Canyons side) for higher-quality, diverse options like sushi and pho, though it can be busy."
      ],
      "base": [
        "High West Saloon (Park City Historic Main Street) for exceptional food, whiskey, and atmosphere; a must-do.",
        "Davanza's (Park City) for casual, delicious pizza and subs, great for a quick and affordable meal.",
        "Drafts Burger Bar (Canyons Village) for convenient, gourmet burgers and a wide selection of craft beers right at the base."
      ]
    },
    "parkingStrategy": "Arrive before 8:30 AM on weekends and holidays for any chance at paid parking at Park City Mountain Village or Canyons Village; reservations are often required for these lots. Otherwise, utilize the free park-and-ride lots like Ecker Hill Transit Center or Jeremy Ranch and take the free bus system directly to the base areas. Buses run frequently and are generally reliable.",
    "crowdPatterns": "Crowds typically surge between 9:30 AM and 11:30 AM, and again from 2:00 PM to 3:30 PM, particularly at the main base lifts (Payday, Red Pine Gondola, Orange Bubble). Weekends and holidays see peak congestion throughout the day, especially from 10:00 AM to 1:00 PM. Mid-week, early mornings and late afternoons are significantly quieter, allowing for better lap times and shorter lift lines."
  },
  "jackson-hole": {
    "resortId": "jackson-hole",
    "generatedAt": "2025-12-10T17:30:54.065Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Jackson Hole is renowned for its steep and deep terrain, offering an unparalleled big mountain experience with iconic features like Corbet's Couloir and vast backcountry access. It combines world-class expert skiing with expansive intermediate grooming and improved beginner zones, making it a challenging yet rewarding destination for all levels.",
    "localTips": [
      "On a powder day, prioritize getting in the Tram line by 8:30 AM at the latest. If you miss the first few trams, head straight to the Bridger Gondola or Sweetwater Gondola for early laps.",
      "For fresh tracks later in the day, traverse out into the Hobacks via the Rendezvous Trail off the top of the Gondola. The further you go, the less tracked it will be.",
      "Don't discount the Thunder Lift area on non-powder days; it often has excellent bumps and consistent snow quality, especially on runs like Thunder and Bernie's Bowl.",
      "If you're an advanced skier and feel confident, consider booking a 'Backcountry Basics' tour with a guide to safely explore the gates off the resort and experience true Teton powder.",
      "Bring fat skis (100mm+ underfoot) if you own them; even on groomer days, the snow often has a soft, forgiving quality, and they're essential for any powder.",
      "Avoid the base area lifts (Teewinot, Sweetwater) between 9:30 AM and 10:30 AM on busy mornings; instead, use the Bridger Gondola to gain elevation quickly.",
      "Take advantage of the free bus service between Teton Village and the town of Jackson to avoid parking hassles and enjoy après-ski without driving concerns."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Eagle's Rest",
        "Sareena's Glade",
        "Pooh Bear",
        "Antelope Flats (off Sweetwater Gondola)"
      ],
      "intermediate": [
        "Rendezvous Trail",
        "Grand Pass",
        "Wide Open",
        "Amphitheater",
        "Gros Ventre"
      ],
      "advanced": [
        "Alta-B",
        "Thunder (bumps)",
        "Bernie's Bowl",
        "Marmot",
        "Dick's Ditch (when groomed)"
      ],
      "expert": [
        "Corbet's Couloir",
        "Alta Chutes",
        "Expert Chutes",
        "Pucker Face",
        "The Hobacks (upper sections, especially 'Green River')",
        "North Colter"
      ]
    },
    "hiddenGems": [
      "Pint-Size: A steep, short glade accessible via a traverse off the top of the Sweetwater Gondola. Often holds untracked snow.",
      "Buffalo Bowl: Requires a short traverse past Rendezvous Bowl (off the Tram); offers open powder fields away from the main traffic.",
      "The Crags: Technical, rocky terrain accessible from the Tram, often overlooked for the more famous couloirs, providing challenging lines.",
      "Sleeping Indian: A tucked-away glade off the Teton Lift, offering consistent pitch and often softer snow later in the day.",
      "Tensleep Bowl: A slightly longer traverse off the Sublette Quad can lead to excellent, less-trafficked powder stashes here."
    ],
    "avoidList": [
      "The Union Pass Quad: Unless you're exploring the specific terrain it services, it's generally a slower, less efficient lift for lapping compared to Sublette or Thunder.",
      "Piste Mountain Bistro for lunch: While the views are fantastic, it's often crowded and overpriced for a quick mid-day meal. Opt for Rendezvous Lodge food court instead.",
      "Renting equipment directly at the base shops on a busy Saturday morning: Book ahead or rent in the town of Jackson to save time and avoid queues.",
      "Corbet's Cabin waffles at peak lunch hour: Lines can be extensive; aim for an early or late waffle run (before 11 AM or after 2 PM) to minimize wait times.",
      "Paying for a full-day Tram pass if you're not planning to ski expert terrain: The Bridger Gondola and other lifts access plenty of great intermediate and advanced terrain at a lower cost."
    ],
    "foodRecs": {
      "onMountain": [
        "Corbet's Cabin (top of Tram - famous waffles)",
        "Casper Restaurant (Casper Lift - solid burgers, chili, easy access)",
        "Nick Wilson's Cowboy Cafe (base area - quick, casual, good value for resort food)",
        "Rendezvous Lodge Food Court (top of Gondola - variety of quick options, good views)"
      ],
      "base": [
        "Mangy Moose Restaurant and Saloon (Teton Village - iconic après-ski, live music, good dinner options)",
        "Spur Restaurant & Bar (Teton Village - Hotel Terra, elevated pub fare, great cocktails)",
        "Teton Thai (Teton Village - excellent, authentic Thai food, can get busy)",
        "The Handle Bar (Teton Village - Four Seasons, upscale casual, great outdoor fire pits)"
      ]
    },
    "parkingStrategy": "Arrive at the Ranch Lot or Village Lot by 8:00 AM on powder days and weekends to guarantee a spot close to the lifts. On weekdays without fresh snow, arriving by 8:30 AM is usually sufficient. Carpooling with 3+ people can qualify for preferred parking in certain lots (check current rules) and save on parking fees. If lots fill, consider parking at Stilson (off Highway 390) and taking the free START bus, which drops directly at the base.",
    "crowdPatterns": "Crowds surge around 9:00 AM at the base lifts (Teewinot, Sweetwater) and especially at the Tram line on powder days, leading to long waits until 10:30 AM. Lunchtime (12:00 PM - 1:30 PM) sees on-mountain lodges fill up; ski through this period for emptier slopes. The Bridger Gondola and Thunder Lift areas tend to distribute crowds well after the initial morning rush. Late afternoon (after 3:00 PM), many skiers head down, leaving the upper mountain (Sublette, Thunder) quieter for final laps, particularly if you're willing to download the Gondola or Tram."
  },
  "mammoth-mountain": {
    "resortId": "mammoth-mountain",
    "generatedAt": "2025-12-10T17:31:19.191Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Mammoth Mountain is a vast, high-altitude resort renowned for its abundant snowfall, diverse terrain ranging from gentle cruisers to expert chutes, and a consistently long ski season. Its towering summit offers breathtaking views and a comprehensive network of lifts connecting multiple base areas, providing an endless playground for all skill levels.",
    "localTips": [
      "On powder days or busy weekends, park at Canyon Lodge or Eagle Lodge before 8 AM to secure a spot and beat the initial rush for lifts.",
      "On crowded days, head to Chairs 13 and 14 on the backside for shorter lift lines and excellent wide-open cruising or untouched snow in the trees.",
      "Monitor the weather closely; Mammoth's weather can change dramatically. Always check the forecast and webcam for summit conditions, as high winds often close the Panorama Gondola and upper mountain lifts.",
      "If the upper mountain is closed due to wind on a powder day, lap Chair 22 or Chair 25 (Eagle Express) for protected, deep powder in the trees.",
      "Park at Canyon or Eagle Lodge and plan your last run to end there, avoiding crowded inter-lodge shuttles at the end of the day.",
      "Avoid the Panorama Gondola at peak times (9-10 AM, 3-4 PM). If you're starting from Main Lodge, try Chair 1 or Chair 3 to access the mountain quickly.",
      "Explore Chair 12; often overlooked, it offers surprisingly fun, ungroomed terrain and fewer crowds, especially after a fresh snow."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Broadway (Main Lodge)",
        "Eagle Run (Eagle Lodge)",
        "Stump Alley Express (lower section, groomed from Chair 2)"
      ],
      "intermediate": [
        "Cornice Bowl (groomed sections)",
        "Road Runner (Chair 3)",
        "Fascination (Chair 5)",
        "Grizzly (Chair 9/10)",
        "Dave's Run (Chair 23)"
      ],
      "advanced": [
        "Santiago (Chair 3)",
        "Philippe's (Chair 23)",
        "Hangman's Hollow (Chair 23)",
        "Dragon's Back (Chair 3/5)",
        "Scoter (Chair 22)"
      ],
      "expert": [
        "Dropout Chutes (accessed from Chair 23)",
        "The Hemlocks (when open, accessed from Chair 14/13 or traverse)",
        "Paranoid Flats (Chair 5, ungroomed)",
        "Huevos Grande (Chair 22)"
      ]
    },
    "hiddenGems": [
      "Chair 22 Trees: After a storm, the gladed runs under and around Chair 22 offer fantastic, protected powder stashes that last longer.",
      "The Fliers off Chair 23: Lesser-known chutes and rock features accessible via a short traverse from the top of Chair 23, offering a quick dose of adrenaline.",
      "Chair 12 Serenity: This older, slower chair often has no line and accesses fun, lightly trafficked terrain, perfect for finding solitude and fresh lines later in the day.",
      "Hemlocks Traverse: When conditions allow, traversing into The Hemlocks off Chair 14 or 13 offers truly unique expert terrain, but requires caution and a partner."
    ],
    "avoidList": [
      "Main Lodge Parking after 8:00 AM on Weekends: It fills up extremely fast, forcing you to park far away and take shuttles.",
      "Panorama Gondola Line during Peak Hours (9-10 AM, 3-4 PM): Lines can be 30-45 minutes long. Use other chairs to access the mountain or avoid descent during these times.",
      "On-Mountain Cafeterias during Lunch Rush (12-1:30 PM): Overpriced and extremely crowded. Pack a lunch or aim for an early/late meal.",
      "Chair 1 (Broadway Express) first thing on a powder day: Everyone flocks here; instead, head to Chair 23 or Chair 25 for better initial laps."
    ],
    "foodRecs": {
      "onMountain": [
        "The Mill Cafe (Chair 23): Best on-mountain food with great BBQ and outdoor seating, lively atmosphere.",
        "McCoy's (Main Lodge): Good for a sit-down lunch with table service and a varied menu, less frantic than cafeteria style.",
        "Grizzly Bar (Canyon Lodge): Classic lodge bar with decent pub food, good for an après-ski drink and snack."
      ],
      "base": [
        "Mammoth Brewing Company: Excellent craft beers and a fantastic menu of upscale pub food, often with live music.",
        "Old New York Deli & Bagel Co.: Perfect for breakfast sandwiches or massive deli sandwiches to fuel your day.",
        "The Mogul Restaurant: A classic steakhouse experience, great for a celebratory dinner after a big ski day."
      ]
    },
    "parkingStrategy": "For weekends and powder days, arrive at Canyon Lodge or Eagle Lodge by 7:30-8:00 AM to secure a free parking spot close to the lifts. If those are full, your best bet is to park at The Mill (Chair 23) or follow signs for satellite lots and take a shuttle. Main Lodge parking fills first and is often the most congested. Utilizing the free town shuttle system from your accommodation is always recommended to avoid parking hassle.",
    "crowdPatterns": "Mammoth sees its heaviest crowds on weekends, especially during peak season (mid-January to March) and holiday periods (Christmas/New Year, MLK, Presidents' Day). Mornings (9-10 AM) and afternoons (3-4 PM) see congestion at all base area lifts and the Panorama Gondola. Mid-day crowds tend to spread out on the mountain, but main arteries like Stump Alley and Broadway remain busy. Weekdays are significantly less crowded, with virtually no lift lines outside of storm days. The upper mountain lifts (e.g., Chair 23, 5) tend to manage crowds better than lower mountain express chairs on busy days."
  },
  "vail": {
    "resortId": "vail",
    "generatedAt": "2025-12-10T17:31:48.977Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Vail offers an expansive and diverse skiing experience, renowned for its legendary Back Bowls and vast frontside groomers, all within a high-end resort setting. Its sheer size allows for endless exploration, catering to every skill level despite often feeling bustling.",
    "localTips": [
      "Hit the Back Bowls early on powder days: Head straight to Gondola One or Riva Bahn Express (Chair 6) to access Sun Up/Sun Down Bowls before they get tracked out. Chair 5 (High Noon Express) will be your best friend.",
      "Ski Blue Sky Basin around lunchtime: While everyone else heads in, commit to the journey out to Blue Sky for quieter, sustained pitches and excellent gladed skiing, particularly on steep runs like \"Steep & Deep.\"",
      "Avoid Mid-Vail and Eagle's Nest lodges during peak lunch hours (12-2 PM): Instead, grab an earlier or later lunch, or pack snacks to maximize ski time and avoid the crowds. Wildwood Smokehouse is a good, slightly less crowded option.",
      "Use Chair 19 (Cascade Village Lift) or Chair 20 (Pride Express) if staying in East/West Vail: These lifts offer direct access to the mountain without battling Vail Village or Lionshead base crowds, perfect for avoiding Gondola One or Eagle Bahn lines.",
      "Utilize the free in-town bus system: It's efficient and will save you from driving and expensive parking once you're settled, connecting all parts of Vail, Lionshead, and surrounding areas.",
      "Don't overlook the frontside glades on lower visibility days: Runs like Mug's Alley off Chair 10 (Highline Express) or Prima Cornice glades can offer fantastic, protected tree skiing when the bowls are socked in.",
      "Explore Game Creek Bowl after 11 AM: This bowl often gets overlooked once the Back Bowls open, offering excellent intermediate cruising and some fun side hits, and is usually less crowded than Sun Up/Sun Down."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Gopher Hill",
        "Practice Parkway",
        "Swingsville (Chair 2, Avanti Express top)",
        "Eagle's Nest Learning Area"
      ],
      "intermediate": [
        "Riva Ridge (upper sections)",
        "Lodgepole",
        "Ramshorn",
        "Lost Boy (Blue Sky Basin)",
        "Poppyfields West"
      ],
      "advanced": [
        "Mudslide",
        "Ouzo",
        "Prima Cornice (watch for Y Chutes entrance)",
        "Look Ma",
        "North Rim (Blue Sky Basin)"
      ],
      "expert": [
        "Sun Down Bowl (especially Ricky's Ridge, Seldom)",
        "Inner Mongolia Bowl",
        "Steep & Deep (Blue Sky Basin)",
        "Prima Cornice (Y Chutes)"
      ]
    },
    "hiddenGems": [
      "Tea Cup Glades (off Chair 21, Tea Cup Express): Often overlooked, these offer fun, mellow tree skiing, especially after fresh snow.",
      "Forever Glade (Blue Sky Basin): Tucked away between Forever and Skree Field, this consistently holds soft snow and offers a true 'out there' feeling.",
      "The Bench (near Chair 4, Mountaintop Express): A secret spot with incredible panoramic views of the Back Bowls, perfect for a quick snack break away from the crowds.",
      "Genghis Khan (Outer Mongolia Bowl): Requires a longer traverse, but the reward is untouched powder and isolation for longer after a storm."
    ],
    "avoidList": [
      "Gondola One (Vail Village) and Eagle Bahn Gondola (Lionshead) before 9:30 AM on weekends/holidays: Lines can be immense. Instead, use Riva Bahn Express (Chair 6) from Golden Peak or Cascade Village Lift (Chair 19) for quicker access.",
      "Mid-Vail and Eagle's Nest cafeterias for lunch: Overpriced, crowded, and generic food. Pack a lunch or seek out smaller spots like Two Elk Lodge (though it can still be busy).",
      "Chair 5 (High Noon Express) on a powder day after 10 AM: It's the main artery for the Back Bowls and gets swamped. Hit it early or traverse to other chairs like Tea Cup Express (Chair 21).",
      "The Gondola One line right at 3:30-4:00 PM for downloading: It gets very long. Plan to ski down Riva Ridge or Golden Peak, or catch it earlier."
    ],
    "foodRecs": {
      "onMountain": [
        "Two Elk Lodge (Blue Sky Basin side of Sun Up Bowl): Excellent atmosphere and diverse, albeit pricier, food options with stunning views.",
        "Wildwood Smokehouse (Wildwood Express, Chair 3): Great BBQ, often a bit less chaotic than Mid-Vail or Eagle's Nest.",
        "The 10th (Mid-Vail, base of Chair 4): Upscale, sit-down dining experience with amazing views and gourmet food. Reservations recommended."
      ],
      "base": [
        "Garfinkel's (Lionshead Base): Classic lively apres-ski spot with good pub fare and a great deck.",
        "Vendetta's (Vail Village): Reliable Italian food, casual atmosphere, good for families.",
        "Sweet Basil (Vail Village): Upscale, contemporary American dining. Great for a nicer dinner, requires reservations far in advance.",
        "Blue Moose Pizza (Vail Village): Casual, family-friendly pizza joint for an easy dinner."
      ]
    },
    "parkingStrategy": "Arrive before 8:00 AM for the Vail Village or Lionshead Parking Structures, especially on weekends or holidays, to secure a spot. Costs are high ($30-$60+ daily depending on demand). For a slightly cheaper (but still expensive) option or if arriving later, check the East Vail or West Vail parking lots and utilize the free bus system; however, these fill up quickly too. Carpooling is highly encouraged to save on costs and find spots.",
    "crowdPatterns": "Vail's crowds typically build quickly from 9:00 AM, peaking between 10:00 AM and 2:00 PM. Frontside lifts like Gondola One, Eagle Bahn, and Chair 4 (Mountaintop Express) see the longest lines in the morning. On powder days, the Back Bowls are swarmed until late morning. Crowds thin out in the Back Bowls and Blue Sky Basin during lunchtime, as many return to the frontside for food. Weekends and major holidays (Christmas/New Year's, MLK, Presidents' Day) are consistently the busiest, with mid-week often offering noticeable relief, especially outside of peak holiday seasons."
  },
  "northstar-california": {
    "resortId": "northstar-california",
    "generatedAt": "2025-12-15T01:29:33.178Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Northstar California is a premier family-friendly resort renowned for its immaculately groomed slopes, diverse terrain, and a luxurious base village experience. It offers an extensive network of wide-open cruisers, challenging gladed runs, and award-winning terrain parks, catering to skiers and riders of all abilities with a strong emphasis on intermediate enjoyment.",
    "localTips": [
      "Hit the Backside (Promised Land, The Burn) first thing in the morning, especially after a fresh snow, for pristine corduroy or powder before it gets tracked.",
      "Use the Vista Express to quickly access intermediate terrain and avoid the longer Big Springs Gondola queue later in the morning on busy days.",
      "For advanced terrain and fewer crowds, head to Lookout Mountain via the Lookout Express, particularly to explore runs like Iron Horse and Challenger.",
      "Lunch early (before 11:30 AM) or late (after 1:30 PM) at Zephyr Lodge or The Lodge at Big Springs to avoid peak congestion.",
      "If the main village area is too busy, utilize the East Rim chair for a quieter experience on runs like Tonka or to access some less-trafficked glades.",
      "Always check the Northstar app for real-time lift wait times; it's invaluable for navigating busy periods.",
      "For a quick and delicious on-mountain treat, grab a waffle from The Waffle Cabin near the top of the Vista Express.",
      "Explore the trees between runs on The Promised Land or near Comstock for some fun, ungroomed stashes on powder days."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Village Run",
        "Big Dipper",
        "Lumberjack",
        "Sidewinder"
      ],
      "intermediate": [
        "Logger's Loop",
        "Pinball",
        "Main Street",
        "Springboard",
        "Orion",
        "Martis Valley Traverse"
      ],
      "advanced": [
        "Snake Eyes",
        "Drifter",
        "Burnout",
        "Powder Bowl",
        "Prosser",
        "The Promised Land",
        "Challenger",
        "Iron Horse"
      ],
      "expert": [
        "Boca",
        "Monument",
        "Tonka",
        "Scorpion",
        "Star Man",
        "The Cabbage Patch Glades"
      ]
    },
    "hiddenGems": [
      "The glades between Challenger and Tonka (look for narrower, untracked entrances off the groomed runs).",
      "The 'golf course' area in Martis Valley on a sunny, spring day; it's wide-open and often overlooked after a fresh snowfall.",
      "The trees off Orion on Lookout Mountain (skier's left before it flattens out) for some fun, medium-pitch glade skiing.",
      "The view from the top of Lookout Mountain towards Lake Tahoe and the surrounding peaks on a clear day."
    ],
    "avoidList": [
      "The Big Springs Gondola between 9:30 AM and 10:30 AM on weekends and holidays – opt for alternative lifts or arrive earlier.",
      "Comstock Express during peak mid-morning hours; it becomes a major choke point for accessing the backside.",
      "The Lodge at Big Springs for peak lunch (12:00 PM - 1:00 PM) unless you enjoy long lines and crowded seating; prices are generally higher for cafeteria-style food.",
      "Paying for premium parking if you can arrive early enough to snag a free shuttle lot spot."
    ],
    "foodRecs": {
      "onMountain": [
        "Zephyr Lodge (higher-end, diverse menu, amazing views from atop the mountain)",
        "The Waffle Cabin (near the top of Vista Express, quick and delicious treat)",
        "Comstock Lodge (good for a quick chili or soup, often less crowded than Big Springs)"
      ],
      "base": [
        "Tavern 6330' (Northstar Village, gastropub fare with good beer selection)",
        "Rubicon Pizza Company (Northstar Village, reliable family-friendly pizza and pasta)",
        "Manzanita at The Ritz-Carlton, Lake Tahoe (upscale dining experience)",
        "Jax at the Tracks (Truckee, classic diner food, great for breakfast/lunch outside the resort)",
        "Highlands Bar at The Ritz-Carlton (excellent après-ski spot with great views and cocktails)"
      ]
    },
    "parkingStrategy": "On weekends and holidays, arrive by 8:00 AM to secure a spot in the free Village Overlook or Castle Peak lots, which offer efficient shuttle service directly to the village. Arriving later often means navigating full lots and potentially paying for premium parking closer to the village. Weekdays are more forgiving, but early arrival is always best.",
    "crowdPatterns": "Northstar experiences its heaviest crowds on weekends and during holiday periods, particularly at the Big Springs Gondola and Comstock Express between 9:30 AM and 11:00 AM. The village base area can also get very congested during peak arrival and departure times. Weekdays are significantly less crowded. Crowds tend to disperse more towards the Backside and Lookout Mountain, especially after the initial morning rush. Expect heavier traffic on groomed blues mid-day and at the terrain parks."
  },
  "windham": {
    "resortId": "windham",
    "generatedAt": "2026-01-10T00:50:26.261Z",
    "sources": [
      "Reddit",
      "Forums"
    ],
    "overview": "Windham Mountain offers a classic Catskills ski experience, popular with families and intermediates from the NYC metro area. It boasts extensive grooming, a variety of terrain focused on cruisers, and a friendly atmosphere, making it a reliable choice for weekend trips while also catering to some advanced challenges.",
    "localTips": [
      "Ski the East Peak first: Head straight to the East Peak Express (Chair B) on busy mornings for quick laps on runs like Whistler and Wolverine before the main base area gets packed.",
      "Mid-Week is Gold: If possible, visit on a Tuesday, Wednesday, or Thursday for virtually no lift lines and open slopes, especially in the afternoon.",
      "Utilize the Wheelhouse Lodge: For a quieter mid-day break or lunch, skip the main base lodge and head to the Wheelhouse Lodge at the top of the Wheelchair trail. It's less hectic and offers great views.",
      "Lap Whiteway: The Whiteway lift (Chair C) is a slower fixed-grip, but it often has shorter lines and services some excellent intermediate cruisers like Wheelchair and Way to Go, perfect for sustained laps.",
      "Après-Ski Early: The base lodge bar gets slammed post-ski. If you want a drink, hit it up an hour before closing or head into town for more options.",
      "Glade Hunting: After a fresh snowfall, venture into the Wolverine Glades or other marked glades off the East Peak for hidden stashes, but be aware they can get skied out quickly.",
      "Know Your Exit: On crowded days, if you're parked further out, consider downloading on the Wonderama Triple (Chair D) at the end of the day to avoid the congested base area ski out."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Wraparound",
        "Whisper",
        "Warm Up"
      ],
      "intermediate": [
        "Wide Connection",
        "Wheelchair",
        "Wolverine",
        "Upper Wipeout",
        "What's Up"
      ],
      "advanced": [
        "Wanderer",
        "World Cup",
        "Whistler",
        "The Gauntlet"
      ],
      "expert": [
        "Freefall",
        "Wolverine Glade",
        "Upper Wolverine (when conditions are challenging)"
      ]
    },
    "hiddenGems": [
      "The View from Wheelhouse Lodge Deck: Grab a hot chocolate and enjoy the panoramic views of the Catskills from the deck of the Wheelhouse Lodge, especially on a clear day.",
      "Lower Wolverine Glade Entrance: Tucked away off the main Wolverine run, this entrance to the glade often holds softer snow longer than the more obvious access points.",
      "The \"Secret\" Traverse to Whistler: A quick traverse from the top of the East Peak Express (Chair B) can lead you directly into a less-skied section of Whistler after a fresh dump."
    ],
    "avoidList": [
      "K-Lift (Chairs A & E) on busy mornings: The main K-Lift Express and the Wonderama Triple (Chair D) at the base can develop long lines, especially between 9:30 AM and 11:30 AM. Opt for East Peak Express (Chair B) or Whiteway (Chair C) first.",
      "Eating lunch at the Main Base Lodge between 12-1 PM: It's a zoo. Expect long lines, crowded tables, and generally higher prices. Utilize the Wheelhouse Lodge or pack a lunch.",
      "Buying full-price rentals/gear at the base shop: Generally more expensive than pre-booking online or renting from local shops in town.",
      "The main parking lot entrance at peak times: Can get backed up onto the main road. If arriving late, be prepared for a wait and potentially a shuttle."
    ],
    "foodRecs": {
      "onMountain": [
        "Wheelhouse Lodge: Best for a quieter, more relaxed lunch with basic options and scenic views.",
        "Waffle Hut: Near the base of the K-Lift, great for a quick, delicious warm-up snack.",
        "Base Lodge Cafeteria: Standard ski lodge fare, convenient but can be chaotic at peak times."
      ],
      "base": [
        "Zephyr Restaurant: Upscale American fare, great for a nice dinner.",
        "Tap House Grille: Classic pub food, good beer selection, lively atmosphere.",
        "Babylon Cafe: Surprisingly good Mediterranean options, a local favorite.",
        "Higher Grounds Coffee Shop: Essential for morning coffee and pastries before hitting the slopes."
      ]
    },
    "parkingStrategy": "Arrive by 8:15 AM on weekends/holidays to secure a spot in the closest main lots (Lots A & B). If arriving later (after 9 AM), expect to be directed to outer lots (C & D) or even shuttle lots further down the road; in this case, park closest to the shuttle stop. Consider dropping off gear at the base before parking on busy days.",
    "crowdPatterns": "Weekends and holidays see significant crowds, especially from 9:30 AM to 2:00 PM. The K-Lift (main express) and Wonderama Triple (Chair D) are typically the most congested. Early mornings (8:00 AM - 9:30 AM) and late afternoons (2:30 PM - 4:00 PM) offer lighter lines. Mid-week (Tuesday-Thursday) is generally very quiet with minimal waits. Expect a surge around lunch in the base lodge and a noticeable evening rush for après-ski at the main bar."
  }
}