{
  "heavenly-tahoe": {
    "resortId": "heavenly-tahoe",
    "generatedAt": "2025-12-09T04:51:15.547Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Heavenly is a massive resort straddling the California and Nevada states, renowned for its breathtaking panoramic views of Lake Tahoe from nearly every run. It boasts an incredibly diverse terrain spanning over 4,800 acres, from wide-open groomers to challenging tree runs and steep canyons, catering to all skill levels with its unique dual-state experience.",
    "localTips": [
      "Start on the Nevada side (Boulder or Stagecoach) on busy days to avoid the Gondola crowds and access the more open, faster lifts early.",
      "Utilize the Sky Express lift early to access prime intermediate terrain and get to the California side efficiently before it gets backed up.",
      "For fresh tracks on a powder day, head straight to Mott Canyon via the Mott Canyon gate (requires traversing) or Killebrew Canyon via the Comet Express.",
      "Catch a sunset from the Ridge Run or any run overlooking the lake on the California side; the views are unparalleled, especially as the last light hits.",
      "On sunny days, explore the tree runs around the Milky Way Bowl for softer snow and fewer crowds than the main groomed trails.",
      "Avoid eating at the Tamarack Lodge around peak lunch (12-1:30 PM); it gets incredibly crowded. Instead, pack a sandwich or try Stagecoach Lodge or East Peak Lodge for slightly less chaos.",
      "Keep an eye on the wind; the upper mountain lifts (Sky Express, Dipper Express, Comet Express) are often the first to go on high-wind days, shifting traffic to lower lifts.",
      "If you're an advanced rider, always check if Mott and Killebrew Canyons are open; they offer some of Heavenly's most challenging and rewarding terrain."
    ],
    "bestRunsByLevel": {
      "beginner": ["Patsy's", "Maggie's", "Boulder Bowl"],
      "intermediate": [
        "California Trail",
        "Ridge Run",
        "Orion",
        "Liz's",
        "Big Dipper"
      ],
      "advanced": [
        "The Face",
        "Gunbarrel",
        "Powderbowl",
        "Milky Way (trees)",
        "Mott Canyon (initial entrances)"
      ],
      "expert": [
        "Killebrew Canyon",
        "Mott Canyon (Steepest sections like Jackpot or Promenade)",
        "East Bowl (unmarked trees off Stagecoach)"
      ]
    },
    "hiddenGems": [
      "The unmarked glades off of Stagecoach Express, particularly looker's left near the 'East Bowl' area for surprising powder stashes.",
      "The views from the top of the Gunbarrel Express, especially on a clear morning, offer a unique perspective of the lake and surrounding peaks.",
      "The quiet, often overlooked tree runs accessible from the Dipper Express on the Nevada side, especially after a fresh snowfall.",
      "The small 'Sky Forest' area near the top of Sky Express; often untracked and playful for advanced intermediates."
    ],
    "avoidList": [
      "The Gondola mid-station food court during peak lunch hours; it's incredibly crowded and overpriced.",
      "The Galaxy Express lift on busy weekends; it can be slow and feeds into already crowded areas.",
      "Relying solely on the Gondola for uphill travel if you're comfortable driving to a base lodge; the lines can be daunting.",
      "The main Gondola Base retail shops for serious gear purchases; better deals are often found in independent shops in town."
    ],
    "foodRecs": {
      "onMountain": [
        "Stagecoach Lodge (Nevada side): Less crowded than Tamarack, solid chili and burgers, great deck.",
        "California Lodge Cafeteria (California side): Decent breakfast burritos and a good place to warm up, gets crowded but moves fast.",
        "East Peak Lodge (Nevada side): Good for a quick snack or warm drink, often overlooked."
      ],
      "base": [
        "Basecamp Pizza (Heavenly Village): Lively atmosphere, great wood-fired pizzas, live music.",
        "Azul Latin Kitchen (Heavenly Village): Excellent tacos and margaritas, good for aprés-ski.",
        "Cold Water Brewery & Grill (South Lake Tahoe): Local craft beer and elevated pub fare, a bit further but worth the drive.",
        "Driftwood Cafe (South Lake Tahoe): Excellent breakfast/brunch spot, often a wait but worth it."
      ]
    },
    "parkingStrategy": "Arrive by 8:00 AM on weekends and holidays for the best chance at free parking. The California Lodge lot offers convenient free parking with direct lift access, but fills quickly. Alternatively, head to the Boulder or Stagecoach Lodge lots on the Nevada side for free parking and quicker access to the mountain, though they are a bit further from South Lake Tahoe's main village. The Heavenly Village Gondola parking structure is convenient but paid ($20-30+ per day) and can fill by 9:00 AM on busy days.",
    "crowdPatterns": "Heavenly experiences significant crowds on weekends, especially during holiday periods and powder days. The Gondola line is typically the first to build by 8:30 AM. On-mountain, areas around Tamarack Lodge, the top of the Gondola, and the California Trail see the most traffic. Weekdays, especially Tuesday-Thursday, are significantly less crowded. Crowds tend to thin out on the far Nevada side (Boulder/Stagecoach areas) and in the advanced terrain of Mott and Killebrew Canyons. Lifts like Sky Express, Comet Express, and Dipper Express often have shorter lines after the initial morning rush."
  },
  "okemo": {
    "resortId": "okemo",
    "generatedAt": "2025-12-09T06:04:33.812Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Okemo is renowned for its impeccably groomed, wide-open cruisers, making it a paradise for intermediates and families. With a modern high-speed lift system and diverse terrain spread across several distinct faces, it offers a consistent, enjoyable experience for all ability levels, though true experts might seek more extreme challenges elsewhere.",
    "localTips": [
      "Start your day at Jackson Gore Peak; its dedicated parking lot, lift access (Jackson Gore Express), and base amenities often mean shorter lines early on compared to the Clock Tower base.",
      "Head to the South Face via the South Ridge Quad or Sunburst Six for less crowded, excellent intermediate cruising, especially after 11 AM when the Clock Tower crowds spread out.",
      "For consistent groomers, stick to the main trails off the Sunburst Six, particularly Upper and Lower World Cup, before they get skied off.",
      "On colder days or for a quick warm-up, utilize the enclosed bubbles of the Sunburst Six or Quantum Four lifts.",
      "Avoid the Green Ridge Triple on busy days; it's slow and often has long lines. Instead, use the Black Ridge Triple or traverse over from the Sunburst Six.",
      "The terrain off the Glades Peak Quad tends to be quieter and offers some fun, slightly less trafficked blue runs and accessible glades.",
      "Check the daily grooming report; Okemo's snowmakers and groomers are top-notch, and even after a lean spell, you can often find fantastic corduroy.",
      "Consider skiing the Clock Tower side first thing on a powder day; the steep pitches on Spillway and Outrage can offer great early turns before they get bumped out."
    ],
    "bestRunsByLevel": {
      "beginner": ["Sachem", "Coleman Brook", "Suncatcher", "Easy Rider"],
      "intermediate": [
        "Upper World Cup",
        "Lower World Cup",
        "Sidewinder",
        "Jack-A-Lope",
        "Countdown"
      ],
      "advanced": ["Spillway", "Outrage", "Defiance", "Sel's Choice", "Chief"],
      "expert": [
        "Black Out",
        "Starship Glades",
        "White Star Glades",
        "Wild Thing"
      ]
    },
    "hiddenGems": [
      "The small glades off the sides of Sidewinder on the South Face – often untracked for a bit longer.",
      "The 'Rock Garden' off the top of the Glades Peak Quad, a small natural area that can be fun after fresh snow.",
      "Crazy Train glades, accessible from the top of the Green Ridge Triple, offers a fun, slightly less traveled glade experience compared to the more popular ones.",
      "The trails off the WayBack Quad, like WayBack and Lower Tomahawk, are often overlooked and can provide quiet, consistent cruising."
    ],
    "avoidList": [
      "Green Ridge Triple: Incredibly slow and prone to long lines on busy days. Use the Sunburst Six or traverse from Glades Peak if possible.",
      "Sitting Bull Base Lodge at peak lunch hour: Overcrowded, loud, and can be difficult to find a seat. Pack a lunch or aim for an early/late meal.",
      "Paying full price for food at any on-mountain lodge: Generally overpriced for cafeteria-style fare. Consider bringing snacks and drinks, or utilize local restaurants in Ludlow for better value.",
      "The initial rush down Giallo after getting off the Sunburst Six: It can get very congested. If you're not in a hurry, consider dropping down to World Cup or traversing right towards the South Face."
    ],
    "foodRecs": {
      "onMountain": [
        "Sugar House (Jackson Gore side, good chili)",
        "Summit Lodge (great views, quick break spot)",
        "Sitting Bull Restaurant (upstairs, better quality than downstairs cafeteria)"
      ],
      "base": [
        "Mojo Cafe (Ludlow, Southwestern/Mexican fusion, popular)",
        "DJ's Restaurant (Ludlow, classic American fare, reliable)",
        "Stemwinder (Ludlow, upscale comfort food)",
        "Goodman's American Pie (Ludlow, excellent pizza)"
      ]
    },
    "parkingStrategy": "On weekends and holidays, aim to arrive by 8:00 AM (or even 7:30 AM on powder days) to secure good parking. The Jackson Gore Base (P1, P2 lots) is often the best bet, offering direct access to the Jackson Gore Express Quad and a less congested base lodge. The Clock Tower Base (Main Lot) fills up quickly; if targeting this area, arrive very early or be prepared for shuttle service from outer lots.",
    "crowdPatterns": "Expect significant crowds on weekends and holidays, especially from 9:30 AM to 1:00 PM, with lifts like the Sunburst Six, Quantum Four, and Jackson Gore Express seeing the longest lines. Mid-week offers an uncrowded experience with minimal lift lines. Lunchtime (12:00 PM - 1:30 PM) sees lodges packed and mid-mountain trails getting busy. Crowds typically thin out after 2:30 PM, making for great late-day laps, particularly on the South Face or Glades Peak."
  },
  "mount-snow": {
    "resortId": "mount-snow",
    "generatedAt": "2025-12-09T07:49:45.633Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Mount Snow is a highly accessible, family-friendly resort celebrated for its exceptional grooming, extensive terrain parks in Carinthia, and a wide array of intermediate cruising runs. It offers a classic Southern Vermont ski experience, prioritizing consistent conditions and a welcoming atmosphere over extreme terrain.",
    "localTips": [
      "Hit the Bluebird Express right at opening (8:00 AM weekends, 9:00 AM weekdays) to get fresh corduroy on runs like Beeline or Freefall before crowds build.",
      "For advanced intermediates seeking a challenge without the steeps, explore the Sunbrook side via the Sunbrook Express for consistently good groomers and significantly less traffic.",
      "If the main mountain glades are tracked out, advanced skiers can find often uncrowded and well-preserved glades like Fallen Timbers off the Challenger lift.",
      "Always check the snow report for natural versus machine-made snow; Mount Snow excels at snowmaking, ensuring reliable coverage even in lean years.",
      "Consider skiing the Carinthia Parks on weekdays for more laps and fewer people, allowing for better progression.",
      "To bypass the Bluebird Express bottleneck mid-morning on busy days, take the Grand Summit Express up and traverse towards the Challenger or Sundance lifts.",
      "Pack snacks and water to avoid overpriced lodge food and save valuable ski time during peak lunch rushes.",
      "If conditions are icy, stick to the main groomed trails like Beeline or Snowdance, as Mount Snow's snowmaking creates a durable, consistent surface."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Long John",
        "Cooper's Junction",
        "Mixing Bowl (early morning only)"
      ],
      "intermediate": [
        "Beeline",
        "Snowdance",
        "Freefall",
        "Crossover",
        "Ego Alley",
        "Quantum Leap"
      ],
      "advanced": ["Jester", "Canyon", "Ripcord", "River Run", "Challenger"],
      "expert": [
        "Fallen Timbers",
        "Uncles",
        "The Haul (Carinthia - hike to)",
        "Freefall Glade",
        "Exhibition Glades"
      ]
    },
    "hiddenGems": [
      "Sunbrook Side: Consistently less crowded, offering uninterrupted intermediate cruising with great views and dedicated lifts.",
      "The Haul: A short but steep, hike-to glade within Carinthia Park, often holding fresh snow longer than main mountain glades.",
      "Summit Lodge: Accessible from the Bluebird Express, it's a great spot for a quick, quieter break with better views and often less chaos than the base lodges.",
      "The backside glades off Challenger (e.g., Fallen Timbers, The Abyss) often retain snow quality and see significantly less traffic.",
      "Grand Summit Hotel's Slopeside Access: If staying there, the direct ski-in/ski-out bypasses the main base lodge entirely, especially helpful for early morning laps."
    ],
    "avoidList": [
      "Bluebird Express Line (peak times): From 10 AM to 1 PM on weekends and holidays, waits can be substantial. Use the Grand Summit Express or Challenger lifts as alternatives.",
      "Main Base Lodge Cafeteria (lunch rush): Overpriced, crowded, and inefficient. Pack a lunch or plan to eat very early or late.",
      "The 'Mixing Bowl' area (mid-day): Can become an overwhelming congestion point for beginners, instructors, and cross-traffic, especially after 11 AM.",
      "Sundance Lift: While it accesses good terrain, it's a slower, fixed-grip quad that can feel tedious for multiple laps if other faster options are available.",
      "On-mountain rental shops: Generally more expensive and slower than renting in advance from local shops in West Dover or Wilmington."
    ],
    "foodRecs": {
      "onMountain": [
        "Summit Lodge: Best for a quick bite, decent chili, and a less chaotic bar scene with good views.",
        "Bullwheel Pub (Carinthia Base Lodge): Good for a sit-down meal, craft beers, and elevated pub fare without leaving Carinthia.",
        "Sunbrook Base Lodge: Limited but quieter options, ideal if you're skiing the Sunbrook side."
      ],
      "base": [
        "Dot's Restaurant (Wilmington): A classic, no-frills diner perfect for a hearty breakfast or lunch.",
        "The Dover Forge Restaurant (West Dover): Excellent pub fare, lively atmosphere, and a great dinner spot with a diverse menu.",
        "Sticky Fingers Bakery & Cafe (West Dover): Perfect for coffee, fresh pastries, and delicious sandwiches for breakfast or lunch.",
        "1846 Tavern & Grille (Grand Summit Hotel): A more upscale option for dinner, convenient if staying at the hotel."
      ]
    },
    "parkingStrategy": "Arrive early, targeting 8:00 AM on weekends/holidays, to secure a spot in the Main Base Area Lot (A or B) closest to the Bluebird Express. If full, the Carinthia Base Area Lot offers direct access to its own lifts and shuttle service to the main base. The Sunbrook Lot is the furthest but often has space and offers direct access to quieter intermediate terrain; utilize this if your focus is on that side. Shuttles run frequently from all outer lots.",
    "crowdPatterns": "Weekends, especially Saturday mornings and holiday periods (MLK, Presidents' Day, etc.), experience the heaviest crowds, with Bluebird Express lines peaking between 10 AM and 1 PM. Mid-week (Tuesday-Thursday) is significantly quieter, offering minimal lift lines and wide-open groomers. Friday and Sunday afternoons can be a good balance as many weekenders are arriving or departing. Carinthia can be busy with park riders but its dedicated lifts manage the flow well, while the Sunbrook side consistently has lower traffic throughout the week."
  },
  "kirkwood": {
    "resortId": "kirkwood",
    "generatedAt": "2025-12-09T07:51:04.000Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Kirkwood is a legendary Tahoe resort known for its steep, challenging terrain, deep powder dumps, and authentic mountain culture. With a high base elevation and north-facing aspects, it consistently receives some of the best snow quality in the region, attracting expert skiers and riders seeking ungroomed steeps, chutes, and tree skiing.",
    "localTips": [
      "On powder days, head straight to Chair 6 (The Wall) or Chair 2 (Cornice Express) at opening to access the steepest terrain before it gets tracked out.",
      "The Cirque is Kirkwood's crown jewel for experts—check if it's open and be prepared for mandatory air on some entries; locals often hike the ridge for fresh lines.",
      "For intermediates, stick to Chairs 4 and 5 on the backside (Timber Creek/Sunrise Bowl) for mellower, less crowded terrain with excellent tree skiing.",
      "Arrive early on weekends and powder days; parking fills by 8:30 AM, and Chair 6 lines can be 20+ minutes by 9:00 AM.",
      "Avoid the main lodge at lunch—it's a zoo. Instead, pack snacks or hit the Cornice Grill for faster service.",
      "If winds close the upper mountain, Chair 10 and the backside remain sheltered and often have great conditions.",
      "Locals know to ski the trees off Chair 4 (Zachary, Palisades area) for consistent powder stashes that hold snow longer.",
      "Check the avalanche report and respect closures—Kirkwood's terrain is serious, and out-of-bounds areas can be deadly."
    ],
    "bestRunsByLevel": {
      "beginner": ["Bunny", "Snowkirk", "Graduation"],
      "intermediate": [
        "Hully Gully",
        "Zachary",
        "Sunrise Bowl",
        "Timber Creek",
        "Lower Wagon Trail"
      ],
      "advanced": [
        "The Wall (Chair 6)",
        "Palisades",
        "Sentinel Bowl",
        "Cornice Bowl",
        "Monte Wolfe"
      ],
      "expert": [
        "The Cirque (all chutes)",
        "The Fingers",
        "Palisades Chutes",
        "Thunder Saddle",
        "Sisters (hike-to)"
      ]
    },
    "hiddenGems": [
      "The trees skier's left off Chair 4 (Zachary area) often hold untracked powder days after the main bowls are skied out.",
      "Sunrise Bowl on the backside is a local favorite for mellow, scenic cruising with far fewer crowds than the front side.",
      "The Wave (accessed via Chair 2) is a natural halfpipe feature that's incredibly fun on a powder day.",
      "Chair 10 (Snowkirk) provides access to beginner terrain but also some surprisingly fun, sheltered tree skiing for intermediates.",
      "The ridge hike above The Cirque offers some of the best expert terrain in Tahoe, but requires avalanche gear and experience."
    ],
    "avoidList": [
      "Main Base Lodge during lunch (12-1:30 PM): Absolute chaos. Pack your own food or eat early/late.",
      "Chair 6 line after 9:30 AM on weekends: Can exceed 30 minutes. Hit it first thing or wait until after 2 PM.",
      "The Cornice Express (Chair 2) on icy days: The steep groomers can be unforgiving; stick to the backside or lower mountain.",
      "Driving up Highway 88 without chains or 4WD in winter: The road is steep and frequently requires chains; be prepared or take the shuttle.",
      "Buying gear at the resort: Extremely limited selection and high prices. Rent or purchase in South Lake Tahoe before arriving."
    ],
    "foodRecs": {
      "onMountain": [
        "Cornice Grill: Fastest on-mountain option, decent burgers and chili.",
        "Main Lodge Cafeteria: Avoid at peak times, but has the most variety if you can beat the rush.",
        "Red Cliffs Day Lodge: Quieter, smaller menu, good for a quick warm-up."
      ],
      "base": [
        "Kirkwood Inn & Saloon: Classic mountain bar with hearty food, live music, and great après atmosphere.",
        "The Kirkwood Market: Grab-and-go sandwiches, snacks, and groceries if staying in the area.",
        "Off the Wall Bar & Grill (Kirkwood Mountain Resort): Solid pub fare, good beer selection, convenient slopeside location.",
        "For better dining, drive to South Lake Tahoe (45 min) for far more options like Edgewood Restaurant or Riva Grill."
      ]
    },
    "parkingStrategy": "Arrive by 8:00 AM on weekends and powder days to secure parking in the main lot near Chair 6. If full, overflow lots require a shuttle ride. Midweek parking is generally stress-free. Consider carpooling or using the shuttle from South Lake Tahoe to avoid parking hassles entirely. The resort also offers paid reserved parking for guaranteed spots on busy days.",
    "crowdPatterns": "Kirkwood sees heavy crowds on weekends, holidays, and powder days, especially at Chair 6 (The Wall) and Chair 2 (Cornice Express). Lines peak between 9:30 AM and 1:00 PM. Midweek (Tuesday-Thursday) is significantly quieter with minimal lift lines. The backside (Chairs 4, 5, 10) consistently has lighter traffic. Crowds thin out after 2:30 PM, making for excellent late-day laps if conditions hold."
  },
  "hunter-mountain": {
    "resortId": "hunter-mountain",
    "generatedAt": "2025-12-09T07:51:04.000Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Hunter Mountain is the premier ski destination in the Catskills, known for its challenging terrain, extensive snowmaking, and proximity to New York City. With a vertical drop of 1,600 feet and a reputation for steep, icy groomers, it attracts serious East Coast skiers seeking a no-frills, old-school mountain experience.",
    "localTips": [
      "Hit the F lift (Hunter West) first thing on weekends to avoid the main mountain crowds and access some of the best intermediate terrain.",
      "On icy days, focus on the freshly groomed trails off the A and B lifts early morning before they get scraped off.",
      "Advanced skiers should prioritize Hellgate, Annapurna, and K-27 early in the day when conditions are firmest and most consistent.",
      "Avoid the main base lodge at all costs during lunch—it's overcrowded and slow. Pack food or eat at the West Side lodge.",
      "Weekdays (especially Tuesday-Thursday) offer a completely different experience with minimal crowds and short lift lines.",
      "Hunter's snowmaking is aggressive; even in marginal conditions, the main trails are usually well-covered and fast.",
      "The terrain parks are well-maintained and popular with younger crowds; if that's not your scene, stick to the steeper trails.",
      "Parking fills early on weekends—arrive by 8:00 AM or be prepared for overflow lots and shuttle rides."
    ],
    "bestRunsByLevel": {
      "beginner": ["Racer's Edge", "Snowdance", "Belt Parkway"],
      "intermediate": ["Hunter One", "Crossover", "Ike", "Westway", "Broadway"],
      "advanced": ["Hellgate", "Annapurna", "K-27", "Cliffs", "Eisenhower"],
      "expert": [
        "Hellgate (bumps)",
        "K-27 (bumps)",
        "Cliffs (steep, icy)",
        "Annapurna (steep, icy)"
      ]
    },
    "hiddenGems": [
      "Hunter West (F lift) is consistently less crowded and offers excellent intermediate cruising with well-maintained groomers.",
      "The glades off the D lift (when open) provide surprisingly fun tree skiing for advanced skiers, though they're not always groomed.",
      "Early morning laps on the A lift before 9:00 AM offer the best snow conditions and shortest lines.",
      "The view from the summit on a clear day is spectacular, overlooking the entire Catskills range.",
      "The West Side lodge is far quieter than the main base and has faster food service."
    ],
    "avoidList": [
      "Main Base Lodge during lunch (12-2 PM): Absolute chaos, long lines, overpriced food. Avoid at all costs.",
      "The D lift on busy weekends: Slow, old double chair that feeds crowded terrain. Use A, B, or F lifts instead.",
      "Driving up Route 23A in heavy snow without 4WD or chains: The road is steep and can be treacherous.",
      "Buying lift tickets at the window: Always more expensive than online; purchase in advance to save money.",
      "Expecting powder days: Hunter is known for hard-packed, icy conditions; adjust expectations accordingly."
    ],
    "foodRecs": {
      "onMountain": [
        "West Side Lodge: Quieter, faster service, decent burgers and pizza.",
        "Main Base Lodge Cafeteria: Avoid during peak times, but has the most variety.",
        "Slope Side Pub: Good for a beer and quick bite, less crowded than main cafeteria."
      ],
      "base": [
        "Scribner Hollow Lodge: Classic mountain lodge with hearty American fare and a cozy atmosphere.",
        "Pancho Villa's Mexican Restaurant (Tannersville): Great tacos and margaritas, popular après spot.",
        "Last Chance Antiques & Cheese Cafe (Tannersville): Excellent sandwiches, coffee, and baked goods.",
        "Deer Mountain Inn (Tannersville): Upscale dining option for a special dinner, farm-to-table menu."
      ]
    },
    "parkingStrategy": "Arrive by 8:00 AM on weekends and holidays to secure parking in the main lot closest to the base lodge. If full, overflow lots require a shuttle ride (5-10 minutes). Midweek parking is generally stress-free. Hunter also offers paid reserved parking for guaranteed spots on busy days. Consider carpooling from NYC to reduce parking stress and environmental impact.",
    "crowdPatterns": "Hunter sees massive crowds on weekends and holidays, especially from NYC metro area skiers. Lift lines peak between 10:00 AM and 2:00 PM, with the A and B lifts seeing the longest waits. Midweek (Tuesday-Thursday) is dramatically quieter with minimal lines. The F lift (Hunter West) consistently has shorter waits. Crowds thin out after 2:30 PM, making for better late-day skiing if conditions allow."
  },
  "valfrejus": {
    "resortId": "valfrejus",
    "generatedAt": "2025-12-10T17:28:33.294Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Valfrejus is a charming and unpretentious French resort in the Maurienne Valley, celebrated for its excellent value, relaxed atmosphere, and typically uncrowded slopes. It's a fantastic choice for families and those seeking a less bustling experience, offering diverse terrain with particularly good tree skiing opportunities for all levels.",
    "localTips": [
      "Head straight to the Punta Bagna or L'Armera lifts on powder mornings to find the best fresh tracks before the crowds.",
      "Explore the marked 'Piste des Trappeurs' (blue) for a fun, winding run through the forest that often remains quiet.",
      "During whiteout conditions, stick to the tree-lined runs like Les Essarts or Les Glaciers for improved visibility and definition.",
      "For a more affordable and varied lunch experience, ski down to the village rather than relying solely on the on-mountain restaurants.",
      "Utilize the Col du Jeu chairlift in the afternoon; it accesses some lovely intermediate terrain that often sees fewer skiers than the main gondola area.",
      "Keep an eye on the sun-exposed slopes around Plateau d'Arrondaz on colder days, as the snow tends to soften there first.",
      "Don't shy away from the short but steep black run 'Le Lavoir' when conditions are good; it's a great challenge for advanced skiers within the resort."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Plateau d'Arrondaz (nursery slopes at the top of the gondola)",
        "Les Bergers (green)",
        "Le Jeu (green)"
      ],
      "intermediate": [
        "L'Armera (blue)",
        "Col du Jeu (blue)",
        "Les Essarts (blue)",
        "Combe Orcières (blue)",
        "Piste des Trappeurs (blue)"
      ],
      "advanced": [
        "Les Glaciers (red, steep and often well-groomed)",
        "Le Lavoir (black)",
        "Punta Bagna (black, especially the top section)"
      ],
      "expert": [
        "Ungroomed sections adjacent to Les Glaciers (conditions permitting)",
        "Steeper, ungroomed sections directly under the Punta Bagna lift",
        "Off-piste descents from Pointe d'Arrondaz (requires local knowledge or a guide)"
      ]
    },
    "hiddenGems": [
      "The small snack shack near the top of the Col du Jeu lift for a quiet, budget-friendly coffee or vin chaud with stunning views.",
      "The gladed areas accessible from the sides of Les Essarts and L'Armera for safe, playful tree skiing on powder days.",
      "The furthest reaches of the L'Armera blue run provide excellent, less trafficked cruising with beautiful scenery."
    ],
    "avoidList": [
      "The main Arrondaz Telecabin (gondola) between 9:00 AM - 10:00 AM on weekend and holiday mornings due to potential queues.",
      "Overpriced and often crowded 'Le Relais de la Pointe' at Plateau d'Arrondaz for lunch; better options exist in the village.",
      "The lower, flatter sections of runs like lower L'Armera late in the day, as they can become heavily scraped and icy.",
      "The short, slow 'Le Chalet d'Arrondaz' drag lift unless you're a absolute beginner; better to use the chairlifts for progression."
    ],
    "foodRecs": {
      "onMountain": [
        "L'Altipiano (at Plateau d'Arrondaz): Good variety, spacious, and decent food with a lively atmosphere.",
        "L'Armera (near the L'Armera lift top station): A more rustic, traditional option known for Savoyard specialties and smaller crowds."
      ],
      "base": [
        "La Cordée (village): Excellent for traditional French and local Savoyard cuisine, especially raclette and tartiflette.",
        "Le Bistrot (village): A casual spot offering good value pizzas, burgers, and hearty daily specials.",
        "Bar/Restaurant Les Bergers (at the foot of the nursery slopes): Convenient for families, great for a quick lunch or après-ski drink."
      ]
    },
    "parkingStrategy": "On weekends and during French school holidays, arrive before 8:30 AM to guarantee a spot in the heated underground P1 (Parking Téléo) lot directly at the base of the gondola. On weekdays, arriving by 9:00 AM is generally sufficient. If P1 is full, follow signs for smaller overflow lots further down the access road, but be prepared for a short walk or shuttle bus.",
    "crowdPatterns": "Valfrejus generally experiences lighter crowds than larger resorts. The main gondola bottleneck is typically between 9:00 AM and 10:00 AM on peak days. Slopes are quietest mid-morning (10:30 AM - 12:00 PM) and mid-afternoon (2:00 PM - 4:00 PM). On-mountain restaurants are busiest from 12:30 PM to 1:30 PM. The upper lifts like Punta Bagna and Col du Jeu usually offer the least crowded skiing throughout the day, especially mid-week outside of school holidays."
  },
  "aspen-snowmass": {
    "resortId": "aspen-snowmass",
    "generatedAt": "2025-12-10T17:30:06.600Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Aspen Snowmass is a world-renowned ski destination comprising four distinct mountains (Snowmass, Aspen Mountain, Aspen Highlands, Buttermilk), offering unparalleled diversity from luxurious groomers to extreme steeps. It blends a sophisticated, vibrant atmosphere with vast, high-altitude terrain suitable for every level, all accessible via a highly efficient lift system and free inter-mountain transport.",
    "localTips": [
      "Leverage the free RFTA bus system; it connects all four mountains and towns efficiently, making parking unnecessary and saving money.",
      "Don't overlook Aspen Highlands; the Highland Bowl hike is a quintessential Aspen experience with unmatched expert terrain and views.",
      "For fresh tracks, head to Snowmass's High Alpine lift or Aspen Mountain's Bell Mountain first thing after a storm.",
      "Download the Aspen Snowmass app for real-time lift statuses, grooming reports, and interactive trail maps.",
      "Consider the 'First Tracks' program on Aspen Mountain to enjoy untouched corduroy and early access before the public.",
      "Pack layers and hydrate constantly; the high altitude (up to 12,500 ft) means weather can change rapidly and dehydration is common.",
      "Explore Buttermilk, especially if you have beginners or park enthusiasts; it's often quieter and has excellent learning zones.",
      "For quieter dining, plan lunch either before 11:30 AM or after 1:30 PM to avoid the peak lodge crowds."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Panda Peak (Buttermilk)",
        "Westward Ho (Buttermilk)",
        "Assay Hill (Snowmass)",
        "Funnel (Snowmass)"
      ],
      "intermediate": [
        "Long Shot (Snowmass)",
        "Sheer Bliss (Snowmass)",
        "Sunnyside (Snowmass)",
        "Little Nell (Aspen Mountain)",
        "Ruthie's Run (Aspen Mountain)"
      ],
      "advanced": [
        "Steeplechase (Highlands)",
        "Loge Peak Area (Highlands)",
        "Upper Powderhorn (Snowmass)",
        "The Cirque (Snowmass - requires hike)",
        "Walsh's (Aspen Mountain)",
        "Hyrup's (Aspen Mountain)"
      ],
      "expert": [
        "Highland Bowl (Highlands - numerous lines like Oly, Mushroom, Steep Ravine)",
        "Bell Mountain Glades (Aspen Mountain)",
        "Silver Queen Glades (Aspen Mountain)",
        "Roberto's Glade (Aspen Mountain)",
        "Cirque Headwall (Snowmass)",
        "Hanging Valley Glades (Snowmass)"
      ]
    },
    "hiddenGems": [
      "The 'Shrines' on Aspen Mountain (especially Jerry's Shrine under Ruthie's chair, often overlooked and unique local tributes).",
      "Hanging Valley Wall on Snowmass on a powder day (accessed via High Alpine lift, a bit of a traverse, often holds snow longer).",
      "Picnic tables at the top of Elk Camp Gondola on Snowmass for self-packed lunch with amazing views, avoiding lodge crowds.",
      "The sustained, quiet pitches of Golden Horn and Spar Gulch on Aspen Mountain, especially on less crowded weekdays.",
      "The secluded trees off Sneaky's on Aspen Highlands for untouched stashes after a storm."
    ],
    "avoidList": [
      "**Overpriced Food:** Cloud Nine Alpine Bistro (while iconic for its party scene, lunch prices are extremely high for on-mountain fare).",
      "**Crowds:** The bottom of the Silver Queen Gondola on Aspen Mountain between 9-10 AM and 3-4 PM can get heavily congested. Also, the Elk Camp Gondola line on Snowmass during peak lunch hour.",
      "**Inefficient Lifts:** Buttermilk's Teaser Lift is a bit slower, but generally the lift infrastructure across all four mountains is excellent. Avoid the bottom-most lifts on Snowmass first thing if you can get higher faster.",
      "**Tourist Traps:** Driving and parking in downtown Aspen; it's expensive and limited. Rely on the free bus system instead."
    ],
    "foodRecs": {
      "onMountain": [
        "Elk Camp Restaurant (Snowmass): Excellent variety, great outdoor seating, good value for on-mountain dining.",
        "Sam's (Snowmass): Upscale Italian, sit-down dining with fantastic views.",
        "Bonnie's (Aspen Mountain): Famous for its apple strudel, oatmeal pancakes, and hearty American fare. Get there early.",
        "Merry-Go-Round (Aspen Highlands): Great burgers and a more laid-back vibe, often less crowded than Aspen Mountain lodges."
      ],
      "base": [
        "Slice (Snowmass Village Mall): Casual, family-friendly pizza and Italian.",
        "Big Hoss Grill (Snowmass Village): Solid American fare, good portions, lively atmosphere.",
        "Ajax Tavern (Aspen Mountain base): Iconic après-ski spot famous for truffle fries and people-watching.",
        "Hickory House (Aspen): Classic Aspen steakhouse, excellent food, more upscale but worth it.",
        "White House Tavern (Aspen): Upscale American, great atmosphere and cocktails, sister restaurant to Ajax Tavern."
      ]
    },
    "parkingStrategy": "For Snowmass, arrive by 8:15 AM for Lot 3 (free before 8 AM, then paid) or the Two Creeks lot (paid, direct lift access). Alternatively, park free at the Intercept Lot on Highway 82 and use the free shuttle to Snowmass Base Village. For Aspen Highlands, free parking is available but fills by 8:30 AM on weekends/powder days. For Aspen Mountain, parking at the gondola base is very limited and expensive; it's best to park at the Rio Grande Parking Garage in Aspen or use the free RFTA buses from Snowmass or the Intercept Lot.",
    "crowdPatterns": "Crowds are generally heaviest on weekends, holidays, and powder days, particularly at Aspen Mountain and Snowmass Base Village. Expect lift lines between 9-10 AM at main gondolas (Silver Queen, Elk Camp) and during peak lunch hours (12-1:30 PM) at on-mountain lodges. Weekdays are significantly quieter, especially at Aspen Highlands and Buttermilk. After 10 AM, crowds tend to disperse across Snowmass due to its vast terrain. The après-ski scene kicks off around 3 PM at base areas like Ajax Tavern and the Snowmass Mall/Base Village."
  },
  "park-city": {
    "resortId": "park-city",
    "generatedAt": "2025-12-10T17:30:33.052Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Park City Mountain Resort, the largest ski resort in the U.S., offers an expansive and diverse terrain perfect for all skill levels. It features two distinct base areas – Park City Mountain Village and Canyons Village – connected by the Quicksilver Gondola, providing a vast interconnected experience.",
    "localTips": [
      "On powder mornings, head straight to Jupiter Lift from the Park City side, or 9990 Lift from the Canyons side, for the best ungroomed snow before the crowds arrive.",
      "Utilize the Crescent Express Lift early from the Park City base to bypass Payday Express queues and access the central mountain faster.",
      "For less crowded intermediate terrain, especially mid-day, venture over to the Sun Peak and Super Condor lifts on the Canyons side.",
      "If staying in town, use the free public bus system to get to the resorts; it's more efficient than driving and battling for parking.",
      "Don't ski Homerun to the Park City base at the end of the day; it gets very crowded and scraped off. Instead, take Town Lift if available, or download the Payday Express.",
      "Explore the Iron Mountain area via the Iron Mountain Express at Canyons for varied terrain, often with fewer people than central Canyons."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "First Time",
        "Homerun (upper section)",
        "Sweet Pea",
        "Red Pine Road (upper part)"
      ],
      "intermediate": [
        "King Con",
        "Parley's Park",
        "Doc's Run",
        "Sun Peak",
        "Saddleback Express",
        "Chicane"
      ],
      "advanced": [
        "McConkey's Bowl",
        "Jupiter Access",
        "Black Forest",
        "Thaynes Canyon",
        "Pinecone Ridge",
        "Charlie's Dream"
      ],
      "expert": [
        "Jupiter Peak (chutes)",
        "Puma Bowl",
        "Ninety-Nine 90 (steep pitches)",
        "Murdock Peak",
        "The Super Bowl"
      ]
    },
    "hiddenGems": [
      "The trees off Iron Mountain Express for untouched powder a day or two after a storm.",
      "Fantasy Land and Canis Major/Minor accessed from Jupiter Lift for challenging glades.",
      "Sunrise Bowl after a fresh snowfall, often overlooked by those heading directly to McConkey's.",
      "The runs off the Peak 5 Express at Canyons, specifically the glades like 'The Pines', for quiet and playful tree skiing."
    ],
    "avoidList": [
      "Payday Express Lift at Park City Base between 9:30 AM and 10:30 AM, especially on weekends; queues are massive.",
      "The main Canyons Village Gondola for uphill access after 9:30 AM; opt for Red Pine Gondola if available or go early.",
      "Eating lunch at Cloud Dine or Red Pine Lodge between 12:00 PM and 1:30 PM; expect long lines and crowded tables.",
      "Driving to the Park City Mountain Village or Canyons Village base on weekends or holidays without a parking reservation; you'll be turned away.",
      "Skiing the Lower Homerun trail to the Park City base at the very end of the day, as it gets icy, crowded, and mogulled out."
    ],
    "foodRecs": {
      "onMountain": [
        "Mid-Mountain Lodge (Park City side) for solid chili and historical ambiance, often less crowded than other central lodges.",
        "Lookout Cabin (Park City side) for a more upscale lunch experience with excellent views and sit-down service (reservations recommended).",
        "Cloud Dine (Canyons side) for higher-quality, diverse options like sushi and pho, though it can be busy."
      ],
      "base": [
        "High West Saloon (Park City Historic Main Street) for exceptional food, whiskey, and atmosphere; a must-do.",
        "Davanza's (Park City) for casual, delicious pizza and subs, great for a quick and affordable meal.",
        "Drafts Burger Bar (Canyons Village) for convenient, gourmet burgers and a wide selection of craft beers right at the base."
      ]
    },
    "parkingStrategy": "Arrive before 8:30 AM on weekends and holidays for any chance at paid parking at Park City Mountain Village or Canyons Village; reservations are often required for these lots. Otherwise, utilize the free park-and-ride lots like Ecker Hill Transit Center or Jeremy Ranch and take the free bus system directly to the base areas. Buses run frequently and are generally reliable.",
    "crowdPatterns": "Crowds typically surge between 9:30 AM and 11:30 AM, and again from 2:00 PM to 3:30 PM, particularly at the main base lifts (Payday, Red Pine Gondola, Orange Bubble). Weekends and holidays see peak congestion throughout the day, especially from 10:00 AM to 1:00 PM. Mid-week, early mornings and late afternoons are significantly quieter, allowing for better lap times and shorter lift lines."
  },
  "jackson-hole": {
    "resortId": "jackson-hole",
    "generatedAt": "2025-12-10T17:30:54.065Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Jackson Hole is renowned for its steep and deep terrain, offering an unparalleled big mountain experience with iconic features like Corbet's Couloir and vast backcountry access. It combines world-class expert skiing with expansive intermediate grooming and improved beginner zones, making it a challenging yet rewarding destination for all levels.",
    "localTips": [
      "On a powder day, prioritize getting in the Tram line by 8:30 AM at the latest. If you miss the first few trams, head straight to the Bridger Gondola or Sweetwater Gondola for early laps.",
      "For fresh tracks later in the day, traverse out into the Hobacks via the Rendezvous Trail off the top of the Gondola. The further you go, the less tracked it will be.",
      "Don't discount the Thunder Lift area on non-powder days; it often has excellent bumps and consistent snow quality, especially on runs like Thunder and Bernie's Bowl.",
      "If you're an advanced skier and feel confident, consider booking a 'Backcountry Basics' tour with a guide to safely explore the gates off the resort and experience true Teton powder.",
      "Bring fat skis (100mm+ underfoot) if you own them; even on groomer days, the snow often has a soft, forgiving quality, and they're essential for any powder.",
      "Avoid the base area lifts (Teewinot, Sweetwater) between 9:30 AM and 10:30 AM on busy mornings; instead, use the Bridger Gondola to gain elevation quickly.",
      "Take advantage of the free bus service between Teton Village and the town of Jackson to avoid parking hassles and enjoy après-ski without driving concerns."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Eagle's Rest",
        "Sareena's Glade",
        "Pooh Bear",
        "Antelope Flats (off Sweetwater Gondola)"
      ],
      "intermediate": [
        "Rendezvous Trail",
        "Grand Pass",
        "Wide Open",
        "Amphitheater",
        "Gros Ventre"
      ],
      "advanced": [
        "Alta-B",
        "Thunder (bumps)",
        "Bernie's Bowl",
        "Marmot",
        "Dick's Ditch (when groomed)"
      ],
      "expert": [
        "Corbet's Couloir",
        "Alta Chutes",
        "Expert Chutes",
        "Pucker Face",
        "The Hobacks (upper sections, especially 'Green River')",
        "North Colter"
      ]
    },
    "hiddenGems": [
      "Pint-Size: A steep, short glade accessible via a traverse off the top of the Sweetwater Gondola. Often holds untracked snow.",
      "Buffalo Bowl: Requires a short traverse past Rendezvous Bowl (off the Tram); offers open powder fields away from the main traffic.",
      "The Crags: Technical, rocky terrain accessible from the Tram, often overlooked for the more famous couloirs, providing challenging lines.",
      "Sleeping Indian: A tucked-away glade off the Teton Lift, offering consistent pitch and often softer snow later in the day.",
      "Tensleep Bowl: A slightly longer traverse off the Sublette Quad can lead to excellent, less-trafficked powder stashes here."
    ],
    "avoidList": [
      "The Union Pass Quad: Unless you're exploring the specific terrain it services, it's generally a slower, less efficient lift for lapping compared to Sublette or Thunder.",
      "Piste Mountain Bistro for lunch: While the views are fantastic, it's often crowded and overpriced for a quick mid-day meal. Opt for Rendezvous Lodge food court instead.",
      "Renting equipment directly at the base shops on a busy Saturday morning: Book ahead or rent in the town of Jackson to save time and avoid queues.",
      "Corbet's Cabin waffles at peak lunch hour: Lines can be extensive; aim for an early or late waffle run (before 11 AM or after 2 PM) to minimize wait times.",
      "Paying for a full-day Tram pass if you're not planning to ski expert terrain: The Bridger Gondola and other lifts access plenty of great intermediate and advanced terrain at a lower cost."
    ],
    "foodRecs": {
      "onMountain": [
        "Corbet's Cabin (top of Tram - famous waffles)",
        "Casper Restaurant (Casper Lift - solid burgers, chili, easy access)",
        "Nick Wilson's Cowboy Cafe (base area - quick, casual, good value for resort food)",
        "Rendezvous Lodge Food Court (top of Gondola - variety of quick options, good views)"
      ],
      "base": [
        "Mangy Moose Restaurant and Saloon (Teton Village - iconic après-ski, live music, good dinner options)",
        "Spur Restaurant & Bar (Teton Village - Hotel Terra, elevated pub fare, great cocktails)",
        "Teton Thai (Teton Village - excellent, authentic Thai food, can get busy)",
        "The Handle Bar (Teton Village - Four Seasons, upscale casual, great outdoor fire pits)"
      ]
    },
    "parkingStrategy": "Arrive at the Ranch Lot or Village Lot by 8:00 AM on powder days and weekends to guarantee a spot close to the lifts. On weekdays without fresh snow, arriving by 8:30 AM is usually sufficient. Carpooling with 3+ people can qualify for preferred parking in certain lots (check current rules) and save on parking fees. If lots fill, consider parking at Stilson (off Highway 390) and taking the free START bus, which drops directly at the base.",
    "crowdPatterns": "Crowds surge around 9:00 AM at the base lifts (Teewinot, Sweetwater) and especially at the Tram line on powder days, leading to long waits until 10:30 AM. Lunchtime (12:00 PM - 1:30 PM) sees on-mountain lodges fill up; ski through this period for emptier slopes. The Bridger Gondola and Thunder Lift areas tend to distribute crowds well after the initial morning rush. Late afternoon (after 3:00 PM), many skiers head down, leaving the upper mountain (Sublette, Thunder) quieter for final laps, particularly if you're willing to download the Gondola or Tram."
  },
  "mammoth-mountain": {
    "resortId": "mammoth-mountain",
    "generatedAt": "2025-12-10T17:31:19.191Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Mammoth Mountain is a vast, high-altitude resort renowned for its abundant snowfall, diverse terrain ranging from gentle cruisers to expert chutes, and a consistently long ski season. Its towering summit offers breathtaking views and a comprehensive network of lifts connecting multiple base areas, providing an endless playground for all skill levels.",
    "localTips": [
      "On powder days or busy weekends, park at Canyon Lodge or Eagle Lodge before 8 AM to secure a spot and beat the initial rush for lifts.",
      "On crowded days, head to Chairs 13 and 14 on the backside for shorter lift lines and excellent wide-open cruising or untouched snow in the trees.",
      "Monitor the weather closely; Mammoth's weather can change dramatically. Always check the forecast and webcam for summit conditions, as high winds often close the Panorama Gondola and upper mountain lifts.",
      "If the upper mountain is closed due to wind on a powder day, lap Chair 22 or Chair 25 (Eagle Express) for protected, deep powder in the trees.",
      "Park at Canyon or Eagle Lodge and plan your last run to end there, avoiding crowded inter-lodge shuttles at the end of the day.",
      "Avoid the Panorama Gondola at peak times (9-10 AM, 3-4 PM). If you're starting from Main Lodge, try Chair 1 or Chair 3 to access the mountain quickly.",
      "Explore Chair 12; often overlooked, it offers surprisingly fun, ungroomed terrain and fewer crowds, especially after a fresh snow."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Broadway (Main Lodge)",
        "Eagle Run (Eagle Lodge)",
        "Stump Alley Express (lower section, groomed from Chair 2)"
      ],
      "intermediate": [
        "Cornice Bowl (groomed sections)",
        "Road Runner (Chair 3)",
        "Fascination (Chair 5)",
        "Grizzly (Chair 9/10)",
        "Dave's Run (Chair 23)"
      ],
      "advanced": [
        "Santiago (Chair 3)",
        "Philippe's (Chair 23)",
        "Hangman's Hollow (Chair 23)",
        "Dragon's Back (Chair 3/5)",
        "Scoter (Chair 22)"
      ],
      "expert": [
        "Dropout Chutes (accessed from Chair 23)",
        "The Hemlocks (when open, accessed from Chair 14/13 or traverse)",
        "Paranoid Flats (Chair 5, ungroomed)",
        "Huevos Grande (Chair 22)"
      ]
    },
    "hiddenGems": [
      "Chair 22 Trees: After a storm, the gladed runs under and around Chair 22 offer fantastic, protected powder stashes that last longer.",
      "The Fliers off Chair 23: Lesser-known chutes and rock features accessible via a short traverse from the top of Chair 23, offering a quick dose of adrenaline.",
      "Chair 12 Serenity: This older, slower chair often has no line and accesses fun, lightly trafficked terrain, perfect for finding solitude and fresh lines later in the day.",
      "Hemlocks Traverse: When conditions allow, traversing into The Hemlocks off Chair 14 or 13 offers truly unique expert terrain, but requires caution and a partner."
    ],
    "avoidList": [
      "Main Lodge Parking after 8:00 AM on Weekends: It fills up extremely fast, forcing you to park far away and take shuttles.",
      "Panorama Gondola Line during Peak Hours (9-10 AM, 3-4 PM): Lines can be 30-45 minutes long. Use other chairs to access the mountain or avoid descent during these times.",
      "On-Mountain Cafeterias during Lunch Rush (12-1:30 PM): Overpriced and extremely crowded. Pack a lunch or aim for an early/late meal.",
      "Chair 1 (Broadway Express) first thing on a powder day: Everyone flocks here; instead, head to Chair 23 or Chair 25 for better initial laps."
    ],
    "foodRecs": {
      "onMountain": [
        "The Mill Cafe (Chair 23): Best on-mountain food with great BBQ and outdoor seating, lively atmosphere.",
        "McCoy's (Main Lodge): Good for a sit-down lunch with table service and a varied menu, less frantic than cafeteria style.",
        "Grizzly Bar (Canyon Lodge): Classic lodge bar with decent pub food, good for an après-ski drink and snack."
      ],
      "base": [
        "Mammoth Brewing Company: Excellent craft beers and a fantastic menu of upscale pub food, often with live music.",
        "Old New York Deli & Bagel Co.: Perfect for breakfast sandwiches or massive deli sandwiches to fuel your day.",
        "The Mogul Restaurant: A classic steakhouse experience, great for a celebratory dinner after a big ski day."
      ]
    },
    "parkingStrategy": "For weekends and powder days, arrive at Canyon Lodge or Eagle Lodge by 7:30-8:00 AM to secure a free parking spot close to the lifts. If those are full, your best bet is to park at The Mill (Chair 23) or follow signs for satellite lots and take a shuttle. Main Lodge parking fills first and is often the most congested. Utilizing the free town shuttle system from your accommodation is always recommended to avoid parking hassle.",
    "crowdPatterns": "Mammoth sees its heaviest crowds on weekends, especially during peak season (mid-January to March) and holiday periods (Christmas/New Year, MLK, Presidents' Day). Mornings (9-10 AM) and afternoons (3-4 PM) see congestion at all base area lifts and the Panorama Gondola. Mid-day crowds tend to spread out on the mountain, but main arteries like Stump Alley and Broadway remain busy. Weekdays are significantly less crowded, with virtually no lift lines outside of storm days. The upper mountain lifts (e.g., Chair 23, 5) tend to manage crowds better than lower mountain express chairs on busy days."
  },
  "vail": {
    "resortId": "vail",
    "generatedAt": "2025-12-10T17:31:48.977Z",
    "sources": ["Reddit", "Forums"],
    "overview": "Vail offers an expansive and diverse skiing experience, renowned for its legendary Back Bowls and vast frontside groomers, all within a high-end resort setting. Its sheer size allows for endless exploration, catering to every skill level despite often feeling bustling.",
    "localTips": [
      "Hit the Back Bowls early on powder days: Head straight to Gondola One or Riva Bahn Express (Chair 6) to access Sun Up/Sun Down Bowls before they get tracked out. Chair 5 (High Noon Express) will be your best friend.",
      "Ski Blue Sky Basin around lunchtime: While everyone else heads in, commit to the journey out to Blue Sky for quieter, sustained pitches and excellent gladed skiing, particularly on steep runs like \"Steep & Deep.\"",
      "Avoid Mid-Vail and Eagle's Nest lodges during peak lunch hours (12-2 PM): Instead, grab an earlier or later lunch, or pack snacks to maximize ski time and avoid the crowds. Wildwood Smokehouse is a good, slightly less crowded option.",
      "Use Chair 19 (Cascade Village Lift) or Chair 20 (Pride Express) if staying in East/West Vail: These lifts offer direct access to the mountain without battling Vail Village or Lionshead base crowds, perfect for avoiding Gondola One or Eagle Bahn lines.",
      "Utilize the free in-town bus system: It's efficient and will save you from driving and expensive parking once you're settled, connecting all parts of Vail, Lionshead, and surrounding areas.",
      "Don't overlook the frontside glades on lower visibility days: Runs like Mug's Alley off Chair 10 (Highline Express) or Prima Cornice glades can offer fantastic, protected tree skiing when the bowls are socked in.",
      "Explore Game Creek Bowl after 11 AM: This bowl often gets overlooked once the Back Bowls open, offering excellent intermediate cruising and some fun side hits, and is usually less crowded than Sun Up/Sun Down."
    ],
    "bestRunsByLevel": {
      "beginner": [
        "Gopher Hill",
        "Practice Parkway",
        "Swingsville (Chair 2, Avanti Express top)",
        "Eagle's Nest Learning Area"
      ],
      "intermediate": [
        "Riva Ridge (upper sections)",
        "Lodgepole",
        "Ramshorn",
        "Lost Boy (Blue Sky Basin)",
        "Poppyfields West"
      ],
      "advanced": [
        "Mudslide",
        "Ouzo",
        "Prima Cornice (watch for Y Chutes entrance)",
        "Look Ma",
        "North Rim (Blue Sky Basin)"
      ],
      "expert": [
        "Sun Down Bowl (especially Ricky's Ridge, Seldom)",
        "Inner Mongolia Bowl",
        "Steep & Deep (Blue Sky Basin)",
        "Prima Cornice (Y Chutes)"
      ]
    },
    "hiddenGems": [
      "Tea Cup Glades (off Chair 21, Tea Cup Express): Often overlooked, these offer fun, mellow tree skiing, especially after fresh snow.",
      "Forever Glade (Blue Sky Basin): Tucked away between Forever and Skree Field, this consistently holds soft snow and offers a true 'out there' feeling.",
      "The Bench (near Chair 4, Mountaintop Express): A secret spot with incredible panoramic views of the Back Bowls, perfect for a quick snack break away from the crowds.",
      "Genghis Khan (Outer Mongolia Bowl): Requires a longer traverse, but the reward is untouched powder and isolation for longer after a storm."
    ],
    "avoidList": [
      "Gondola One (Vail Village) and Eagle Bahn Gondola (Lionshead) before 9:30 AM on weekends/holidays: Lines can be immense. Instead, use Riva Bahn Express (Chair 6) from Golden Peak or Cascade Village Lift (Chair 19) for quicker access.",
      "Mid-Vail and Eagle's Nest cafeterias for lunch: Overpriced, crowded, and generic food. Pack a lunch or seek out smaller spots like Two Elk Lodge (though it can still be busy).",
      "Chair 5 (High Noon Express) on a powder day after 10 AM: It's the main artery for the Back Bowls and gets swamped. Hit it early or traverse to other chairs like Tea Cup Express (Chair 21).",
      "The Gondola One line right at 3:30-4:00 PM for downloading: It gets very long. Plan to ski down Riva Ridge or Golden Peak, or catch it earlier."
    ],
    "foodRecs": {
      "onMountain": [
        "Two Elk Lodge (Blue Sky Basin side of Sun Up Bowl): Excellent atmosphere and diverse, albeit pricier, food options with stunning views.",
        "Wildwood Smokehouse (Wildwood Express, Chair 3): Great BBQ, often a bit less chaotic than Mid-Vail or Eagle's Nest.",
        "The 10th (Mid-Vail, base of Chair 4): Upscale, sit-down dining experience with amazing views and gourmet food. Reservations recommended."
      ],
      "base": [
        "Garfinkel's (Lionshead Base): Classic lively apres-ski spot with good pub fare and a great deck.",
        "Vendetta's (Vail Village): Reliable Italian food, casual atmosphere, good for families.",
        "Sweet Basil (Vail Village): Upscale, contemporary American dining. Great for a nicer dinner, requires reservations far in advance.",
        "Blue Moose Pizza (Vail Village): Casual, family-friendly pizza joint for an easy dinner."
      ]
    },
    "parkingStrategy": "Arrive before 8:00 AM for the Vail Village or Lionshead Parking Structures, especially on weekends or holidays, to secure a spot. Costs are high ($30-$60+ daily depending on demand). For a slightly cheaper (but still expensive) option or if arriving later, check the East Vail or West Vail parking lots and utilize the free bus system; however, these fill up quickly too. Carpooling is highly encouraged to save on costs and find spots.",
    "crowdPatterns": "Vail's crowds typically build quickly from 9:00 AM, peaking between 10:00 AM and 2:00 PM. Frontside lifts like Gondola One, Eagle Bahn, and Chair 4 (Mountaintop Express) see the longest lines in the morning. On powder days, the Back Bowls are swarmed until late morning. Crowds thin out in the Back Bowls and Blue Sky Basin during lunchtime, as many return to the frontside for food. Weekends and major holidays (Christmas/New Year's, MLK, Presidents' Day) are consistently the busiest, with mid-week often offering noticeable relief, especially outside of peak holiday seasons."
  }
}
